Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
/*
** ###################################################################
**     Processors:          MIMXRT1151DHM8B
**                          MIMXRT1151DVM8B
**                          MIMXRT1151XHM8B
**                          MIMXRT1151XVM8B
**                          MIMXRT1152AHM6B
**                          MIMXRT1152AVM6B
**                          MIMXRT1152DHM8B
**                          MIMXRT1152DVM8B
**                          MIMXRT1152XHM8B
**                          MIMXRT1152XVM8B
**
**     Version:             rev. 0.2, 2026-02-26
**     Build:               b260622
**
**     Abstract:
**         CMSIS Peripheral Access Layer for CAAM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2026-01-09)
**         Initial version.
**     - rev. 0.2 (2026-02-26)
**         Update header file based on RM Rev1.
**
** ###################################################################
*/

/*!
 * @file PERI_CAAM.h
 * @version 0.2
 * @date 2026-02-26
 * @brief CMSIS Peripheral Access Layer for CAAM
 *
 * CMSIS Peripheral Access Layer for CAAM
 */

#if !defined(PERI_CAAM_H_)
#define PERI_CAAM_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1151DHM8B) || defined(CPU_MIMXRT1151DVM8B) || defined(CPU_MIMXRT1151XHM8B) || defined(CPU_MIMXRT1151XVM8B))
#include "../MIMXRT1151_COMMON.h"
#elif (defined(CPU_MIMXRT1152AHM6B) || defined(CPU_MIMXRT1152AVM6B) || defined(CPU_MIMXRT1152DHM8B) || defined(CPU_MIMXRT1152DVM8B) || defined(CPU_MIMXRT1152XHM8B) || defined(CPU_MIMXRT1152XVM8B))
#include "../MIMXRT1152_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- CAAM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAAM_Peripheral_Access_Layer CAAM Peripheral Access Layer
 * @{
 */

/** CAAM - Size of Registers Arrays */
#define CAAM_JRADID_COUNT                         4u
#define CAAM_RTICADID_COUNT                       4u
#define CAAM_DECONDID_COUNT                       1u
#define CAAM_JRNSMVBAR_COUNT                      4u
#define CAAM_AID_CNTS_COUNT                       1u
#define CAAM_MPPKRA_COUNT                         64u
#define CAAM_MPMRA_COUNT                          32u
#define CAAM_MPTESTRA_COUNT                       32u
#define CAAM_JDKEKRA_COUNT                        8u
#define CAAM_TDKEKRA_COUNT                        8u
#define CAAM_TDSKRA_COUNT                         8u
#define CAAM_RTENTA_COUNT                         16u
#define CAAM_PX_PG0_COUNT                         16u
#define CAAM_SMWPJR_ARRAY_COUNT                   4u
#define CAAM_HTA_COUNT                            1u
#define CAAM_JRJDDAA_COUNT                        1u
#define CAAM_JOBRING_JRAAA_COUNT                  4u
#define CAAM_JOBRING_PX_JR_COUNT                  16u
#define CAAM_JOBRING_COUNT                        4u
#define CAAM_RMAAB_COUNT                          4u
#define CAAM_RMAAB_RM_COUNT                       2u
#define CAAM_RAMD_COUNT                           4u
#define CAAM_RAMD_RAMD_COUNT                      2u
#define CAAM_RAMD_RAMD_RAMDE_COUNT                32u
#define CAAM_DC_CDC1CTXR_B_COUNT                  16u
#define CAAM_DC_CDC1KEYR_I_COUNT                  8u
#define CAAM_DC_CDC2CTXR_I_COUNT                  18u
#define CAAM_DC_CDC2KEYR_I_COUNT                  32u
#define CAAM_DC_DDMTHB_COUNT                      4u
#define CAAM_DC_DDGTR_COUNT                       1u
#define CAAM_DC_DDSTR_COUNT                       1u
#define CAAM_DC_DDDESB_COUNT                      64u
#define CAAM_DC_COUNT                             1u

/** CAAM - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t MCFGR;                             /**< Master Configuration Register, offset: 0x4 */
  __IO uint32_t PAGE0_SDID;                        /**< Page 0 SDID Register, offset: 0x8 */
  __IO uint32_t SCFGR;                             /**< Security Configuration Register, offset: 0xC */
  struct {                                         /* offset: 0x10, array step: 0x8 */
    __IO uint32_t JRDID_MS;                          /**< Job Ring 0 DID Register - most significant half..Job Ring 3 DID Register - most significant half, array offset: 0x10, array step: 0x8 */
    __IO uint32_t JRDID_LS;                          /**< Job Ring 0 DID Register - least significant half..Job Ring 3 DID Register - least significant half, array offset: 0x14, array step: 0x8 */
  } JRADID[CAAM_JRADID_COUNT];
       uint8_t RESERVED_1[40];
  __IO uint32_t DEBUGCTL;                          /**< Debug Control Register, offset: 0x58 */
  __IO uint32_t JRSTARTR;                          /**< Job Ring Start Register, offset: 0x5C */
  __IO uint32_t RTIC_OWN;                          /**< RTIC OWN Register, offset: 0x60 */
  struct {                                         /* offset: 0x64, array step: 0x8 */
    __IO uint32_t RTIC_DID;                          /**< RTIC DID Register for Block A..RTIC DID Register for Block D, array offset: 0x64, array step: 0x8 */
         uint8_t RESERVED_0[4];
  } RTICADID[CAAM_RTICADID_COUNT];
       uint8_t RESERVED_2[16];
  __IO uint32_t DECORSR;                           /**< DECO Request Source Register, offset: 0x94 */
       uint8_t RESERVED_3[4];
  __IO uint32_t DECORR;                            /**< DECO Request Register, offset: 0x9C */
  struct {                                         /* offset: 0xA0, array step: 0x8 */
    __IO uint32_t DECODID_MS;                        /**< DECO0 DID Register - most significant half, array offset: 0xA0, array step: 0x8 */
    __IO uint32_t DECODID_LS;                        /**< DECO0 DID Register - least significant half, array offset: 0xA4, array step: 0x8 */
  } DECONDID[CAAM_DECONDID_COUNT];
       uint8_t RESERVED_4[120];
  __IO uint32_t DAR;                               /**< DECO Availability Register, offset: 0x120 */
  __O  uint32_t DRR;                               /**< DECO Reset Register, offset: 0x124 */
       uint8_t RESERVED_5[92];
  struct {                                         /* offset: 0x184, array step: 0x8 */
    __IO uint32_t JRSMVBAR;                          /**< Job Ring 0 Secure Memory Virtual Base Address Register..Job Ring 3 Secure Memory Virtual Base Address Register, array offset: 0x184, array step: 0x8 */
         uint8_t RESERVED_0[4];
  } JRNSMVBAR[CAAM_JRNSMVBAR_COUNT];
       uint8_t RESERVED_6[124];
  __IO uint32_t PBSL;                              /**< Peak Bandwidth Smoothing Limit Register, offset: 0x220 */
       uint8_t RESERVED_7[28];
  struct {                                         /* offset: 0x240, array step: 0x10 */
    __I  uint32_t DMA_AIDL_MAP_MS;                   /**< DMA0_AIDL_MAP_MS, array offset: 0x240, array step: 0x10 */
    __I  uint32_t DMA_AIDL_MAP_LS;                   /**< DMA0_AIDL_MAP_LS, array offset: 0x244, array step: 0x10 */
    __I  uint32_t DMA_AIDM_MAP_MS;                   /**< DMA0_AIDM_MAP_MS, array offset: 0x248, array step: 0x10 */
    __I  uint32_t DMA_AIDM_MAP_LS;                   /**< DMA0_AIDM_MAP_LS, array offset: 0x24C, array step: 0x10 */
  } AID_CNTS[CAAM_AID_CNTS_COUNT];
  __I  uint32_t DMA0_AID_ENB;                      /**< DMA0 AXI ID Enable Register, offset: 0x250 */
       uint8_t RESERVED_8[12];
  __IO uint64_t DMA0_ARD_TC;                       /**< DMA0 AXI Read Timing Check Register, offset: 0x260 */
       uint8_t RESERVED_9[4];
  __IO uint32_t DMA0_ARD_LAT;                      /**< DMA0 Read Timing Check Latency Register, offset: 0x26C */
  __IO uint64_t DMA0_AWR_TC;                       /**< DMA0 AXI Write Timing Check Register, offset: 0x270 */
       uint8_t RESERVED_10[4];
  __IO uint32_t DMA0_AWR_LAT;                      /**< DMA0 Write Timing Check Latency Register, offset: 0x27C */
       uint8_t RESERVED_11[128];
  __IO uint8_t MPPKR[CAAM_MPPKRA_COUNT];           /**< Manufacturing Protection Private Key Register, array offset: 0x300, array step: 0x1 */
       uint8_t RESERVED_12[64];
  __IO uint8_t MPMR[CAAM_MPMRA_COUNT];             /**< Manufacturing Protection Message Register, array offset: 0x380, array step: 0x1 */
       uint8_t RESERVED_13[32];
  __I  uint8_t MPTESTR[CAAM_MPTESTRA_COUNT];       /**< Manufacturing Protection Test Register, array offset: 0x3C0, array step: 0x1 */
       uint8_t RESERVED_14[24];
  __I  uint32_t MPECC;                             /**< Manufacturing Protection ECC Register, offset: 0x3F8 */
       uint8_t RESERVED_15[4];
  __IO uint32_t JDKEKR[CAAM_JDKEKRA_COUNT];        /**< Job Descriptor Key Encryption Key Register, array offset: 0x400, array step: 0x4 */
  __IO uint32_t TDKEKR[CAAM_TDKEKRA_COUNT];        /**< Trusted Descriptor Key Encryption Key Register, array offset: 0x420, array step: 0x4 */
  __IO uint32_t TDSKR[CAAM_TDSKRA_COUNT];          /**< Trusted Descriptor Signing Key Register, array offset: 0x440, array step: 0x4 */
       uint8_t RESERVED_16[128];
  __IO uint64_t SKNR;                              /**< Secure Key Nonce Register, offset: 0x4E0 */
       uint8_t RESERVED_17[36];
  __I  uint32_t DMA_STA;                           /**< DMA Status Register, offset: 0x50C */
  __I  uint32_t DMA_X_AID_7_4_MAP;                 /**< DMA_X_AID_7_4_MAP, offset: 0x510 */
  __I  uint32_t DMA_X_AID_3_0_MAP;                 /**< DMA_X_AID_3_0_MAP, offset: 0x514 */
  __I  uint32_t DMA_X_AID_15_12_MAP;               /**< DMA_X_AID_15_12_MAP, offset: 0x518 */
  __I  uint32_t DMA_X_AID_11_8_MAP;                /**< DMA_X_AID_11_8_MAP, offset: 0x51C */
       uint8_t RESERVED_18[4];
  __I  uint32_t DMA_X_AID_15_0_EN;                 /**< DMA_X AXI ID Map Enable Register, offset: 0x524 */
       uint8_t RESERVED_19[8];
  __IO uint32_t DMA_X_ARTC_CTL;                    /**< DMA_X AXI Read Timing Check Control Register, offset: 0x530 */
  __IO uint32_t DMA_X_ARTC_LC;                     /**< DMA_X AXI Read Timing Check Late Count Register, offset: 0x534 */
  __IO uint32_t DMA_X_ARTC_SC;                     /**< DMA_X AXI Read Timing Check Sample Count Register, offset: 0x538 */
  __IO uint32_t DMA_X_ARTC_LAT;                    /**< DMA_X Read Timing Check Latency Register, offset: 0x53C */
  __IO uint32_t DMA_X_AWTC_CTL;                    /**< DMA_X AXI Write Timing Check Control Register, offset: 0x540 */
  __IO uint32_t DMA_X_AWTC_LC;                     /**< DMA_X AXI Write Timing Check Late Count Register, offset: 0x544 */
  __IO uint32_t DMA_X_AWTC_SC;                     /**< DMA_X AXI Write Timing Check Sample Count Register, offset: 0x548 */
  __IO uint32_t DMA_X_AWTC_LAT;                    /**< DMA_X Write Timing Check Latency Register, offset: 0x54C */
       uint8_t RESERVED_20[176];
  __IO uint32_t RTMCTL;                            /**< RNG TRNG Miscellaneous Control Register, offset: 0x600 */
  __IO uint32_t RTSCMISC;                          /**< RNG TRNG Statistical Check Miscellaneous Register, offset: 0x604 */
  __IO uint32_t RTPKRRNG;                          /**< RNG TRNG Poker Range Register, offset: 0x608 */
  union {                                          /* offset: 0x60C */
    __IO uint32_t RTPKRMAX;                          /**< RNG TRNG Poker Maximum Limit Register, offset: 0x60C */
    __I  uint32_t RTPKRSQ;                           /**< RNG TRNG Poker Square Calculation Result Register, offset: 0x60C */
  };
  __IO uint32_t RTSDCTL;                           /**< RNG TRNG Seed Control Register, offset: 0x610 */
  union {                                          /* offset: 0x614 */
    __IO uint32_t RTSBLIM;                           /**< RNG TRNG Sparse Bit Limit Register, offset: 0x614 */
    __I  uint32_t RTTOTSAM;                          /**< RNG TRNG Total Samples Register, offset: 0x614 */
  };
  __IO uint32_t RTFRQMIN;                          /**< RNG TRNG Frequency Count Minimum Limit Register, offset: 0x618 */
  union {                                          /* offset: 0x61C */
    struct {                                         /* offset: 0x61C */
      __I  uint32_t RTFRQCNT;                          /**< RNG TRNG Frequency Count Register, offset: 0x61C */
      __I  uint32_t RTSCMC;                            /**< RNG TRNG Statistical Check Monobit Count Register, offset: 0x620 */
      __I  uint32_t RTSCR1C;                           /**< RNG TRNG Statistical Check Run Length 1 Count Register, offset: 0x624 */
      __I  uint32_t RTSCR2C;                           /**< RNG TRNG Statistical Check Run Length 2 Count Register, offset: 0x628 */
      __I  uint32_t RTSCR3C;                           /**< RNG TRNG Statistical Check Run Length 3 Count Register, offset: 0x62C */
      __I  uint32_t RTSCR4C;                           /**< RNG TRNG Statistical Check Run Length 4 Count Register, offset: 0x630 */
      __I  uint32_t RTSCR5C;                           /**< RNG TRNG Statistical Check Run Length 5 Count Register, offset: 0x634 */
      __I  uint32_t RTSCR6PC;                          /**< RNG TRNG Statistical Check Run Length 6+ Count Register, offset: 0x638 */
    } COUNT;
    struct {                                         /* offset: 0x61C */
      __IO uint32_t RTFRQMAX;                          /**< RNG TRNG Frequency Count Maximum Limit Register, offset: 0x61C */
      __IO uint32_t RTSCML;                            /**< RNG TRNG Statistical Check Monobit Limit Register, offset: 0x620 */
      __IO uint32_t RTSCR1L;                           /**< RNG TRNG Statistical Check Run Length 1 Limit Register, offset: 0x624 */
      __IO uint32_t RTSCR2L;                           /**< RNG TRNG Statistical Check Run Length 2 Limit Register, offset: 0x628 */
      __IO uint32_t RTSCR3L;                           /**< RNG TRNG Statistical Check Run Length 3 Limit Register, offset: 0x62C */
      __IO uint32_t RTSCR4L;                           /**< RNG TRNG Statistical Check Run Length 4 Limit Register, offset: 0x630 */
      __IO uint32_t RTSCR5L;                           /**< RNG TRNG Statistical Check Run Length 5 Limit Register, offset: 0x634 */
      __IO uint32_t RTSCR6PL;                          /**< RNG TRNG Statistical Check Run Length 6+ Limit Register, offset: 0x638 */
    } LIMIT;
  };
  __I  uint32_t RTSTATUS;                          /**< RNG TRNG Status Register, offset: 0x63C */
  __I  uint32_t RTENT[CAAM_RTENTA_COUNT];          /**< RNG TRNG Entropy Read Register, array offset: 0x640, array step: 0x4 */
  __I  uint32_t RTPKRCNT10;                        /**< RNG TRNG Statistical Check Poker Count 1 and 0 Register, offset: 0x680 */
  __I  uint32_t RTPKRCNT32;                        /**< RNG TRNG Statistical Check Poker Count 3 and 2 Register, offset: 0x684 */
  __I  uint32_t RTPKRCNT54;                        /**< RNG TRNG Statistical Check Poker Count 5 and 4 Register, offset: 0x688 */
  __I  uint32_t RTPKRCNT76;                        /**< RNG TRNG Statistical Check Poker Count 7 and 6 Register, offset: 0x68C */
  __I  uint32_t RTPKRCNT98;                        /**< RNG TRNG Statistical Check Poker Count 9 and 8 Register, offset: 0x690 */
  __I  uint32_t RTPKRCNTBA;                        /**< RNG TRNG Statistical Check Poker Count B and A Register, offset: 0x694 */
  __I  uint32_t RTPKRCNTDC;                        /**< RNG TRNG Statistical Check Poker Count D and C Register, offset: 0x698 */
  __I  uint32_t RTPKRCNTFE;                        /**< RNG TRNG Statistical Check Poker Count F and E Register, offset: 0x69C */
       uint8_t RESERVED_21[32];
  __I  uint32_t RDSTA;                             /**< RNG DRNG Status Register, offset: 0x6C0 */
       uint8_t RESERVED_22[12];
  __I  uint32_t RDINT0;                            /**< RNG DRNG State Handle 0 Reseed Interval Register, offset: 0x6D0 */
  __I  uint32_t RDINT1;                            /**< RNG DRNG State Handle 1 Reseed Interval Register, offset: 0x6D4 */
       uint8_t RESERVED_23[8];
  __IO uint32_t RDHCNTL;                           /**< RNG DRNG Hash Control Register, offset: 0x6E0 */
  __I  uint32_t RDHDIG;                            /**< RNG DRNG Hash Digest Register, offset: 0x6E4 */
  __O  uint32_t RDHBUF;                            /**< RNG DRNG Hash Buffer Register, offset: 0x6E8 */
       uint8_t RESERVED_24[788];
  struct {                                         /* offset: 0xA00, array step: 0x10 */
    __I  uint32_t PX_SDID_PG0;                       /**< Partition 0 SDID register..Partition 15 SDID register, array offset: 0xA00, array step: 0x10 */
    __IO uint32_t PX_SMAPR_PG0;                      /**< Secure Memory Access Permissions register, array offset: 0xA04, array step: 0x10 */
    __IO uint32_t PX_SMAG2_PG0;                      /**< Secure Memory Access Group Registers, array offset: 0xA08, array step: 0x10 */
    __IO uint32_t PX_SMAG1_PG0;                      /**< Secure Memory Access Group Registers, array offset: 0xA0C, array step: 0x10 */
  } PX_PG0[CAAM_PX_PG0_COUNT];
  __IO uint32_t REIS;                              /**< Recoverable Error Interrupt Status, offset: 0xB00 */
  __IO uint32_t REIE;                              /**< Recoverable Error Interrupt Enable, offset: 0xB04 */
  __I  uint32_t REIF;                              /**< Recoverable Error Interrupt Force, offset: 0xB08 */
  __IO uint32_t REIH;                              /**< Recoverable Error Interrupt Halt, offset: 0xB0C */
       uint8_t RESERVED_25[192];
  __IO uint32_t SMWPJRR[CAAM_SMWPJR_ARRAY_COUNT];  /**< Secure Memory Write Protect Job Ring Register, array offset: 0xBD0, array step: 0x4 */
       uint8_t RESERVED_26[4];
  __O  uint32_t SMCR_PG0;                          /**< Secure Memory Command Register, offset: 0xBE4 */
       uint8_t RESERVED_27[4];
  __I  uint32_t SMCSR_PG0;                         /**< Secure Memory Command Status Register, offset: 0xBEC */
       uint8_t RESERVED_28[8];
  __I  uint32_t CAAMVID_MS_TRAD;                   /**< CAAM Version ID Register, most-significant half, offset: 0xBF8 */
  __I  uint32_t CAAMVID_LS_TRAD;                   /**< CAAM Version ID Register, least-significant half, offset: 0xBFC */
  struct {                                         /* offset: 0xC00, array step: 0x20 */
    __I  uint64_t HT_JD_ADDR;                        /**< Holding Tank 0 Job Descriptor Address, array offset: 0xC00, array step: 0x20 */
    __I  uint64_t HT_SD_ADDR;                        /**< Holding Tank 0 Shared Descriptor Address, array offset: 0xC08, array step: 0x20 */
    __I  uint32_t HT_JQ_CTRL_MS;                     /**< Holding Tank 0 Job Queue Control, most-significant half, array offset: 0xC10, array step: 0x20 */
    __I  uint32_t HT_JQ_CTRL_LS;                     /**< Holding Tank 0 Job Queue Control, least-significant half, array offset: 0xC14, array step: 0x20 */
         uint8_t RESERVED_0[4];
    __I  uint32_t HT_STATUS;                         /**< Holding Tank Status, array offset: 0xC1C, array step: 0x20 */
  } HTA[CAAM_HTA_COUNT];
       uint8_t RESERVED_29[4];
  __IO uint32_t JQ_DEBUG_SEL;                      /**< Job Queue Debug Select Register, offset: 0xC24 */
       uint8_t RESERVED_30[404];
  __I  uint32_t JRJIDU_LS;                         /**< Job Ring Job IDs in Use Register, least-significant half, offset: 0xDBC */
  __I  uint32_t JRJDJIFBC;                         /**< Job Ring Job-Done Job ID FIFO BC, offset: 0xDC0 */
  __I  uint32_t JRJDJIF;                           /**< Job Ring Job-Done Job ID FIFO, offset: 0xDC4 */
       uint8_t RESERVED_31[28];
  __I  uint32_t JRJDS1;                            /**< Job Ring Job-Done Source 1, offset: 0xDE4 */
       uint8_t RESERVED_32[24];
  __I  uint64_t JRJDDA[CAAM_JRJDDAA_COUNT];        /**< Job Ring Job-Done Descriptor Address 0 Register, array offset: 0xE00, array step: 0x8 */
       uint8_t RESERVED_33[408];
  __I  uint32_t CRNR_MS;                           /**< CHA Revision Number Register, most-significant half, offset: 0xFA0 */
  __I  uint32_t CRNR_LS;                           /**< CHA Revision Number Register, least-significant half, offset: 0xFA4 */
  __I  uint32_t CTPR_MS;                           /**< Compile Time Parameters Register, most-significant half, offset: 0xFA8 */
  __I  uint32_t CTPR_LS;                           /**< Compile Time Parameters Register, least-significant half, offset: 0xFAC */
       uint8_t RESERVED_34[4];
  __I  uint32_t SMSTA;                             /**< Secure Memory Status Register, offset: 0xFB4 */
       uint8_t RESERVED_35[4];
  __I  uint32_t SMPO;                              /**< Secure Memory Partition Owners Register, offset: 0xFBC */
  __I  uint64_t FAR;                               /**< Fault Address Register, offset: 0xFC0 */
  __I  uint32_t FADID;                             /**< Fault Address DID Register, offset: 0xFC8 */
  __I  uint32_t FADR;                              /**< Fault Address Detail Register, offset: 0xFCC */
       uint8_t RESERVED_36[4];
  __I  uint32_t CSTA;                              /**< CAAM Status Register, offset: 0xFD4 */
  __I  uint32_t SMVID_MS;                          /**< Secure Memory Version ID Register, most-significant half, offset: 0xFD8 */
  __I  uint32_t SMVID_LS;                          /**< Secure Memory Version ID Register, least-significant half, offset: 0xFDC */
  __I  uint32_t RVID;                              /**< RTIC Version ID Register, offset: 0xFE0 */
  __I  uint32_t CCBVID;                            /**< CHA Cluster Block Version ID Register, offset: 0xFE4 */
  __I  uint32_t CHAVID_MS;                         /**< CHA Version ID Register, most-significant half, offset: 0xFE8 */
  __I  uint32_t CHAVID_LS;                         /**< CHA Version ID Register, least-significant half, offset: 0xFEC */
  __I  uint32_t CHANUM_MS;                         /**< CHA Number Register, most-significant half, offset: 0xFF0 */
  __I  uint32_t CHANUM_LS;                         /**< CHA Number Register, least-significant half, offset: 0xFF4 */
  __I  uint32_t CAAMVID_MS;                        /**< CAAM Version ID Register, most-significant half, offset: 0xFF8 */
  __I  uint32_t CAAMVID_LS;                        /**< CAAM Version ID Register, least-significant half, offset: 0xFFC */
       uint8_t RESERVED_37[61440];
  struct {                                         /* offset: 0x10000, array step: 0x10000 */
    __IO uint64_t IRBAR_JR;                          /**< Input Ring Base Address Register for Job Ring 0..Input Ring Base Address Register for Job Ring 3, array offset: 0x10000, array step: 0x10000 */
         uint8_t RESERVED_0[4];
    __IO uint32_t IRSR_JR;                           /**< Input Ring Size Register for Job Ring 0..Input Ring Size Register for Job Ring 3, array offset: 0x1000C, array step: 0x10000 */
         uint8_t RESERVED_1[4];
