Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_DMA_AIDL_MAP_MS_AID7_BID_MASK       (0xFF000000U)
#define CAAM_DMA_AIDL_MAP_MS_AID7_BID_SHIFT      (24U)
#define CAAM_DMA_AIDL_MAP_MS_AID7_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDL_MAP_MS_AID7_BID_SHIFT)) & CAAM_DMA_AIDL_MAP_MS_AID7_BID_MASK)
/*! @} */

/* The count of CAAM_DMA_AIDL_MAP_MS */
#define CAAM_DMA_AIDL_MAP_MS_COUNT               (1U)

/*! @name DMA_AIDL_MAP_LS - DMA0_AIDL_MAP_LS */
/*! @{ */

#define CAAM_DMA_AIDL_MAP_LS_AID0_BID_MASK       (0xFFU)
#define CAAM_DMA_AIDL_MAP_LS_AID0_BID_SHIFT      (0U)
#define CAAM_DMA_AIDL_MAP_LS_AID0_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDL_MAP_LS_AID0_BID_SHIFT)) & CAAM_DMA_AIDL_MAP_LS_AID0_BID_MASK)

#define CAAM_DMA_AIDL_MAP_LS_AID1_BID_MASK       (0xFF00U)
#define CAAM_DMA_AIDL_MAP_LS_AID1_BID_SHIFT      (8U)
#define CAAM_DMA_AIDL_MAP_LS_AID1_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDL_MAP_LS_AID1_BID_SHIFT)) & CAAM_DMA_AIDL_MAP_LS_AID1_BID_MASK)

#define CAAM_DMA_AIDL_MAP_LS_AID2_BID_MASK       (0xFF0000U)
#define CAAM_DMA_AIDL_MAP_LS_AID2_BID_SHIFT      (16U)
#define CAAM_DMA_AIDL_MAP_LS_AID2_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDL_MAP_LS_AID2_BID_SHIFT)) & CAAM_DMA_AIDL_MAP_LS_AID2_BID_MASK)

#define CAAM_DMA_AIDL_MAP_LS_AID3_BID_MASK       (0xFF000000U)
#define CAAM_DMA_AIDL_MAP_LS_AID3_BID_SHIFT      (24U)
#define CAAM_DMA_AIDL_MAP_LS_AID3_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDL_MAP_LS_AID3_BID_SHIFT)) & CAAM_DMA_AIDL_MAP_LS_AID3_BID_MASK)
/*! @} */

/* The count of CAAM_DMA_AIDL_MAP_LS */
#define CAAM_DMA_AIDL_MAP_LS_COUNT               (1U)

/*! @name DMA_AIDM_MAP_MS - DMA0_AIDM_MAP_MS */
/*! @{ */

#define CAAM_DMA_AIDM_MAP_MS_AID12_BID_MASK      (0xFFU)
#define CAAM_DMA_AIDM_MAP_MS_AID12_BID_SHIFT     (0U)
#define CAAM_DMA_AIDM_MAP_MS_AID12_BID(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_MS_AID12_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_MS_AID12_BID_MASK)

#define CAAM_DMA_AIDM_MAP_MS_AID13_BID_MASK      (0xFF00U)
#define CAAM_DMA_AIDM_MAP_MS_AID13_BID_SHIFT     (8U)
#define CAAM_DMA_AIDM_MAP_MS_AID13_BID(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_MS_AID13_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_MS_AID13_BID_MASK)

#define CAAM_DMA_AIDM_MAP_MS_AID14_BID_MASK      (0xFF0000U)
#define CAAM_DMA_AIDM_MAP_MS_AID14_BID_SHIFT     (16U)
#define CAAM_DMA_AIDM_MAP_MS_AID14_BID(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_MS_AID14_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_MS_AID14_BID_MASK)

#define CAAM_DMA_AIDM_MAP_MS_AID15_BID_MASK      (0xFF000000U)
#define CAAM_DMA_AIDM_MAP_MS_AID15_BID_SHIFT     (24U)
#define CAAM_DMA_AIDM_MAP_MS_AID15_BID(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_MS_AID15_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_MS_AID15_BID_MASK)
/*! @} */

/* The count of CAAM_DMA_AIDM_MAP_MS */
#define CAAM_DMA_AIDM_MAP_MS_COUNT               (1U)

/*! @name DMA_AIDM_MAP_LS - DMA0_AIDM_MAP_LS */
/*! @{ */

#define CAAM_DMA_AIDM_MAP_LS_AID8_BID_MASK       (0xFFU)
#define CAAM_DMA_AIDM_MAP_LS_AID8_BID_SHIFT      (0U)
#define CAAM_DMA_AIDM_MAP_LS_AID8_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_LS_AID8_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_LS_AID8_BID_MASK)

#define CAAM_DMA_AIDM_MAP_LS_AID9_BID_MASK       (0xFF00U)
#define CAAM_DMA_AIDM_MAP_LS_AID9_BID_SHIFT      (8U)
#define CAAM_DMA_AIDM_MAP_LS_AID9_BID(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_LS_AID9_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_LS_AID9_BID_MASK)

#define CAAM_DMA_AIDM_MAP_LS_AID10_BID_MASK      (0xFF0000U)
#define CAAM_DMA_AIDM_MAP_LS_AID10_BID_SHIFT     (16U)
#define CAAM_DMA_AIDM_MAP_LS_AID10_BID(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_LS_AID10_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_LS_AID10_BID_MASK)

#define CAAM_DMA_AIDM_MAP_LS_AID11_BID_MASK      (0xFF000000U)
#define CAAM_DMA_AIDM_MAP_LS_AID11_BID_SHIFT     (24U)
#define CAAM_DMA_AIDM_MAP_LS_AID11_BID(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_AIDM_MAP_LS_AID11_BID_SHIFT)) & CAAM_DMA_AIDM_MAP_LS_AID11_BID_MASK)
/*! @} */

/* The count of CAAM_DMA_AIDM_MAP_LS */
#define CAAM_DMA_AIDM_MAP_LS_COUNT               (1U)

/*! @name DMA0_AID_ENB - DMA0 AXI ID Enable Register */
/*! @{ */

#define CAAM_DMA0_AID_ENB_AID0E_MASK             (0x1U)
#define CAAM_DMA0_AID_ENB_AID0E_SHIFT            (0U)
#define CAAM_DMA0_AID_ENB_AID0E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID0E_SHIFT)) & CAAM_DMA0_AID_ENB_AID0E_MASK)

#define CAAM_DMA0_AID_ENB_AID1E_MASK             (0x2U)
#define CAAM_DMA0_AID_ENB_AID1E_SHIFT            (1U)
#define CAAM_DMA0_AID_ENB_AID1E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID1E_SHIFT)) & CAAM_DMA0_AID_ENB_AID1E_MASK)

#define CAAM_DMA0_AID_ENB_AID2E_MASK             (0x4U)
#define CAAM_DMA0_AID_ENB_AID2E_SHIFT            (2U)
#define CAAM_DMA0_AID_ENB_AID2E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID2E_SHIFT)) & CAAM_DMA0_AID_ENB_AID2E_MASK)

#define CAAM_DMA0_AID_ENB_AID3E_MASK             (0x8U)
#define CAAM_DMA0_AID_ENB_AID3E_SHIFT            (3U)
#define CAAM_DMA0_AID_ENB_AID3E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID3E_SHIFT)) & CAAM_DMA0_AID_ENB_AID3E_MASK)

#define CAAM_DMA0_AID_ENB_AID4E_MASK             (0x10U)
#define CAAM_DMA0_AID_ENB_AID4E_SHIFT            (4U)
#define CAAM_DMA0_AID_ENB_AID4E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID4E_SHIFT)) & CAAM_DMA0_AID_ENB_AID4E_MASK)

#define CAAM_DMA0_AID_ENB_AID5E_MASK             (0x20U)
#define CAAM_DMA0_AID_ENB_AID5E_SHIFT            (5U)
#define CAAM_DMA0_AID_ENB_AID5E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID5E_SHIFT)) & CAAM_DMA0_AID_ENB_AID5E_MASK)

#define CAAM_DMA0_AID_ENB_AID6E_MASK             (0x40U)
#define CAAM_DMA0_AID_ENB_AID6E_SHIFT            (6U)
#define CAAM_DMA0_AID_ENB_AID6E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID6E_SHIFT)) & CAAM_DMA0_AID_ENB_AID6E_MASK)

#define CAAM_DMA0_AID_ENB_AID7E_MASK             (0x80U)
#define CAAM_DMA0_AID_ENB_AID7E_SHIFT            (7U)
#define CAAM_DMA0_AID_ENB_AID7E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID7E_SHIFT)) & CAAM_DMA0_AID_ENB_AID7E_MASK)

