Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_DMA0_AID_ENB_AID8E_MASK             (0x100U)
#define CAAM_DMA0_AID_ENB_AID8E_SHIFT            (8U)
#define CAAM_DMA0_AID_ENB_AID8E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID8E_SHIFT)) & CAAM_DMA0_AID_ENB_AID8E_MASK)

#define CAAM_DMA0_AID_ENB_AID9E_MASK             (0x200U)
#define CAAM_DMA0_AID_ENB_AID9E_SHIFT            (9U)
#define CAAM_DMA0_AID_ENB_AID9E(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID9E_SHIFT)) & CAAM_DMA0_AID_ENB_AID9E_MASK)

#define CAAM_DMA0_AID_ENB_AID10E_MASK            (0x400U)
#define CAAM_DMA0_AID_ENB_AID10E_SHIFT           (10U)
#define CAAM_DMA0_AID_ENB_AID10E(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID10E_SHIFT)) & CAAM_DMA0_AID_ENB_AID10E_MASK)

#define CAAM_DMA0_AID_ENB_AID11E_MASK            (0x800U)
#define CAAM_DMA0_AID_ENB_AID11E_SHIFT           (11U)
#define CAAM_DMA0_AID_ENB_AID11E(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID11E_SHIFT)) & CAAM_DMA0_AID_ENB_AID11E_MASK)

#define CAAM_DMA0_AID_ENB_AID12E_MASK            (0x1000U)
#define CAAM_DMA0_AID_ENB_AID12E_SHIFT           (12U)
#define CAAM_DMA0_AID_ENB_AID12E(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID12E_SHIFT)) & CAAM_DMA0_AID_ENB_AID12E_MASK)

#define CAAM_DMA0_AID_ENB_AID13E_MASK            (0x2000U)
#define CAAM_DMA0_AID_ENB_AID13E_SHIFT           (13U)
#define CAAM_DMA0_AID_ENB_AID13E(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID13E_SHIFT)) & CAAM_DMA0_AID_ENB_AID13E_MASK)

#define CAAM_DMA0_AID_ENB_AID14E_MASK            (0x4000U)
#define CAAM_DMA0_AID_ENB_AID14E_SHIFT           (14U)
#define CAAM_DMA0_AID_ENB_AID14E(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID14E_SHIFT)) & CAAM_DMA0_AID_ENB_AID14E_MASK)

#define CAAM_DMA0_AID_ENB_AID15E_MASK            (0x8000U)
#define CAAM_DMA0_AID_ENB_AID15E_SHIFT           (15U)
#define CAAM_DMA0_AID_ENB_AID15E(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AID_ENB_AID15E_SHIFT)) & CAAM_DMA0_AID_ENB_AID15E_MASK)
/*! @} */

/*! @name DMA0_ARD_TC - DMA0 AXI Read Timing Check Register */
/*! @{ */

#define CAAM_DMA0_ARD_TC_ARSC_MASK               (0xFFFFFU)
#define CAAM_DMA0_ARD_TC_ARSC_SHIFT              (0U)
#define CAAM_DMA0_ARD_TC_ARSC(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARSC_SHIFT)) & CAAM_DMA0_ARD_TC_ARSC_MASK)

#define CAAM_DMA0_ARD_TC_ARLC_MASK               (0xFFFFF000000U)
#define CAAM_DMA0_ARD_TC_ARLC_SHIFT              (24U)
#define CAAM_DMA0_ARD_TC_ARLC(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARLC_SHIFT)) & CAAM_DMA0_ARD_TC_ARLC_MASK)

#define CAAM_DMA0_ARD_TC_ARL_MASK                (0xFFF000000000000U)
#define CAAM_DMA0_ARD_TC_ARL_SHIFT               (48U)
#define CAAM_DMA0_ARD_TC_ARL(x)                  (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARL_SHIFT)) & CAAM_DMA0_ARD_TC_ARL_MASK)

#define CAAM_DMA0_ARD_TC_ARTL_MASK               (0x1000000000000000U)
#define CAAM_DMA0_ARD_TC_ARTL_SHIFT              (60U)
#define CAAM_DMA0_ARD_TC_ARTL(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARTL_SHIFT)) & CAAM_DMA0_ARD_TC_ARTL_MASK)

#define CAAM_DMA0_ARD_TC_ARTT_MASK               (0x2000000000000000U)
#define CAAM_DMA0_ARD_TC_ARTT_SHIFT              (61U)
#define CAAM_DMA0_ARD_TC_ARTT(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARTT_SHIFT)) & CAAM_DMA0_ARD_TC_ARTT_MASK)

#define CAAM_DMA0_ARD_TC_ARCT_MASK               (0x4000000000000000U)
#define CAAM_DMA0_ARD_TC_ARCT_SHIFT              (62U)
#define CAAM_DMA0_ARD_TC_ARCT(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARCT_SHIFT)) & CAAM_DMA0_ARD_TC_ARCT_MASK)

#define CAAM_DMA0_ARD_TC_ARTCE_MASK              (0x8000000000000000U)
#define CAAM_DMA0_ARD_TC_ARTCE_SHIFT             (63U)
#define CAAM_DMA0_ARD_TC_ARTCE(x)                (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_ARD_TC_ARTCE_SHIFT)) & CAAM_DMA0_ARD_TC_ARTCE_MASK)
/*! @} */

/*! @name DMA0_ARD_LAT - DMA0 Read Timing Check Latency Register */
/*! @{ */

#define CAAM_DMA0_ARD_LAT_SARL_MASK              (0xFFFFFFFFU)
#define CAAM_DMA0_ARD_LAT_SARL_SHIFT             (0U)
#define CAAM_DMA0_ARD_LAT_SARL(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_ARD_LAT_SARL_SHIFT)) & CAAM_DMA0_ARD_LAT_SARL_MASK)
/*! @} */

/*! @name DMA0_AWR_TC - DMA0 AXI Write Timing Check Register */
/*! @{ */

#define CAAM_DMA0_AWR_TC_AWSC_MASK               (0xFFFFFU)
#define CAAM_DMA0_AWR_TC_AWSC_SHIFT              (0U)
#define CAAM_DMA0_AWR_TC_AWSC(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_AWR_TC_AWSC_SHIFT)) & CAAM_DMA0_AWR_TC_AWSC_MASK)

#define CAAM_DMA0_AWR_TC_AWLC_MASK               (0xFFFFF000000U)
#define CAAM_DMA0_AWR_TC_AWLC_SHIFT              (24U)
#define CAAM_DMA0_AWR_TC_AWLC(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_AWR_TC_AWLC_SHIFT)) & CAAM_DMA0_AWR_TC_AWLC_MASK)

#define CAAM_DMA0_AWR_TC_AWL_MASK                (0xFFF000000000000U)
#define CAAM_DMA0_AWR_TC_AWL_SHIFT               (48U)
#define CAAM_DMA0_AWR_TC_AWL(x)                  (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_AWR_TC_AWL_SHIFT)) & CAAM_DMA0_AWR_TC_AWL_MASK)

#define CAAM_DMA0_AWR_TC_AWTT_MASK               (0x2000000000000000U)
#define CAAM_DMA0_AWR_TC_AWTT_SHIFT              (61U)
#define CAAM_DMA0_AWR_TC_AWTT(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_AWR_TC_AWTT_SHIFT)) & CAAM_DMA0_AWR_TC_AWTT_MASK)

#define CAAM_DMA0_AWR_TC_AWCT_MASK               (0x4000000000000000U)
#define CAAM_DMA0_AWR_TC_AWCT_SHIFT              (62U)
#define CAAM_DMA0_AWR_TC_AWCT(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_AWR_TC_AWCT_SHIFT)) & CAAM_DMA0_AWR_TC_AWCT_MASK)

#define CAAM_DMA0_AWR_TC_AWTCE_MASK              (0x8000000000000000U)
#define CAAM_DMA0_AWR_TC_AWTCE_SHIFT             (63U)
#define CAAM_DMA0_AWR_TC_AWTCE(x)                (((uint64_t)(((uint64_t)(x)) << CAAM_DMA0_AWR_TC_AWTCE_SHIFT)) & CAAM_DMA0_AWR_TC_AWTCE_MASK)
/*! @} */

/*! @name DMA0_AWR_LAT - DMA0 Write Timing Check Latency Register */
/*! @{ */

