Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_RDSTA_TF1_MASK                      (0x200U)
#define CAAM_RDSTA_TF1_SHIFT                     (9U)
#define CAAM_RDSTA_TF1(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_TF1_SHIFT)) & CAAM_RDSTA_TF1_MASK)

#define CAAM_RDSTA_ERRCODE_MASK                  (0xF0000U)
#define CAAM_RDSTA_ERRCODE_SHIFT                 (16U)
#define CAAM_RDSTA_ERRCODE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_ERRCODE_SHIFT)) & CAAM_RDSTA_ERRCODE_MASK)

#define CAAM_RDSTA_CE_MASK                       (0x100000U)
#define CAAM_RDSTA_CE_SHIFT                      (20U)
#define CAAM_RDSTA_CE(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_CE_SHIFT)) & CAAM_RDSTA_CE_MASK)

#define CAAM_RDSTA_SKVN_MASK                     (0x40000000U)
#define CAAM_RDSTA_SKVN_SHIFT                    (30U)
#define CAAM_RDSTA_SKVN(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_SKVN_SHIFT)) & CAAM_RDSTA_SKVN_MASK)

#define CAAM_RDSTA_SKVT_MASK                     (0x80000000U)
#define CAAM_RDSTA_SKVT_SHIFT                    (31U)
#define CAAM_RDSTA_SKVT(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_SKVT_SHIFT)) & CAAM_RDSTA_SKVT_MASK)
/*! @} */

/*! @name RDINT0 - RNG DRNG State Handle 0 Reseed Interval Register */
/*! @{ */

#define CAAM_RDINT0_RESINT0_MASK                 (0xFFFFFFFFU)
#define CAAM_RDINT0_RESINT0_SHIFT                (0U)
#define CAAM_RDINT0_RESINT0(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RDINT0_RESINT0_SHIFT)) & CAAM_RDINT0_RESINT0_MASK)
/*! @} */

/*! @name RDINT1 - RNG DRNG State Handle 1 Reseed Interval Register */
/*! @{ */

#define CAAM_RDINT1_RESINT1_MASK                 (0xFFFFFFFFU)
#define CAAM_RDINT1_RESINT1_SHIFT                (0U)
#define CAAM_RDINT1_RESINT1(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RDINT1_RESINT1_SHIFT)) & CAAM_RDINT1_RESINT1_MASK)
/*! @} */

/*! @name RDHCNTL - RNG DRNG Hash Control Register */
/*! @{ */

#define CAAM_RDHCNTL_HD_MASK                     (0x1U)
#define CAAM_RDHCNTL_HD_SHIFT                    (0U)
#define CAAM_RDHCNTL_HD(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RDHCNTL_HD_SHIFT)) & CAAM_RDHCNTL_HD_MASK)

#define CAAM_RDHCNTL_HB_MASK                     (0x2U)
#define CAAM_RDHCNTL_HB_SHIFT                    (1U)
#define CAAM_RDHCNTL_HB(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RDHCNTL_HB_SHIFT)) & CAAM_RDHCNTL_HB_MASK)

#define CAAM_RDHCNTL_HI_MASK                     (0x4U)
#define CAAM_RDHCNTL_HI_SHIFT                    (2U)
#define CAAM_RDHCNTL_HI(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RDHCNTL_HI_SHIFT)) & CAAM_RDHCNTL_HI_MASK)

#define CAAM_RDHCNTL_HTM_MASK                    (0x8U)
#define CAAM_RDHCNTL_HTM_SHIFT                   (3U)
#define CAAM_RDHCNTL_HTM(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_RDHCNTL_HTM_SHIFT)) & CAAM_RDHCNTL_HTM_MASK)

#define CAAM_RDHCNTL_HTC_MASK                    (0x10U)
#define CAAM_RDHCNTL_HTC_SHIFT                   (4U)
#define CAAM_RDHCNTL_HTC(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_RDHCNTL_HTC_SHIFT)) & CAAM_RDHCNTL_HTC_MASK)
/*! @} */

/*! @name RDHDIG - RNG DRNG Hash Digest Register */
/*! @{ */

#define CAAM_RDHDIG_HASHMD_MASK                  (0xFFFFFFFFU)
#define CAAM_RDHDIG_HASHMD_SHIFT                 (0U)
#define CAAM_RDHDIG_HASHMD(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_RDHDIG_HASHMD_SHIFT)) & CAAM_RDHDIG_HASHMD_MASK)
/*! @} */

/*! @name RDHBUF - RNG DRNG Hash Buffer Register */
/*! @{ */

#define CAAM_RDHBUF_HASHBUF_MASK                 (0xFFFFFFFFU)
#define CAAM_RDHBUF_HASHBUF_SHIFT                (0U)
#define CAAM_RDHBUF_HASHBUF(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RDHBUF_HASHBUF_SHIFT)) & CAAM_RDHBUF_HASHBUF_MASK)
/*! @} */

/*! @name PX_SDID_PG0 - Partition 0 SDID register..Partition 15 SDID register */
/*! @{ */

#define CAAM_PX_SDID_PG0_SDID_MASK               (0xFFFFU)
#define CAAM_PX_SDID_PG0_SDID_SHIFT              (0U)
#define CAAM_PX_SDID_PG0_SDID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SDID_PG0_SDID_SHIFT)) & CAAM_PX_SDID_PG0_SDID_MASK)
/*! @} */

/* The count of CAAM_PX_SDID_PG0 */
#define CAAM_PX_SDID_PG0_COUNT                   (16U)

/*! @name PX_SMAPR_PG0 - Secure Memory Access Permissions register */
/*! @{ */

#define CAAM_PX_SMAPR_PG0_G1_READ_MASK           (0x1U)
#define CAAM_PX_SMAPR_PG0_G1_READ_SHIFT          (0U)
/*! G1_READ
 *  0b0..Instruction fetches and reads are prohibited (except that Trusted Descriptor reads (if G1_TDO=1) and
 *       key-reads are always allowed, and exporting Secure Memory Blobs is allowed if G1_SMBLOB=1 or if done by a
 *       Trusted Descriptor and G1_TDO=1).
 *  0b1..Instruction fetches and reads are allowed (but exporting a Secure Memory Blob is prohibited if
 *       G1_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G1_TDO=0).
 */
#define CAAM_PX_SMAPR_PG0_G1_READ(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G1_READ_SHIFT)) & CAAM_PX_SMAPR_PG0_G1_READ_MASK)

#define CAAM_PX_SMAPR_PG0_G1_WRITE_MASK          (0x2U)
#define CAAM_PX_SMAPR_PG0_G1_WRITE_SHIFT         (1U)
/*! G1_WRITE
 *  0b0..Writes are prohibited (except that Trusted Descriptor writes are allowed, and importing Secure Memory
 *       Blobs is allowed if G1_SMBLOB=1 or if done by a Trusted Descriptor and G1_TDO=1).
 *  0b1..Writes are allowed (but importing a Secure Memory Blob is prohibited if G1_SMBLOB=0 and the descriptor is
 *       not a Trusted Descriptor or if G1_TDO=0).
 */
#define CAAM_PX_SMAPR_PG0_G1_WRITE(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G1_WRITE_SHIFT)) & CAAM_PX_SMAPR_PG0_G1_WRITE_MASK)

#define CAAM_PX_SMAPR_PG0_G1_TDO_MASK            (0x4U)
#define CAAM_PX_SMAPR_PG0_G1_TDO_SHIFT           (2U)
/*! G1_TDO
 *  0b0..Trusted Descriptors have the same access privileges as Job Descriptors
 *  0b1..Trusted Descriptors are allowed to override the other access permissions, i.e. they can export blobs from
 *       or import blobs to the partition and read from and write to the partition regardless of the G1_SMBLOB,
 *       G1_WRITE and G1_READ settings.
 */
#define CAAM_PX_SMAPR_PG0_G1_TDO(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G1_TDO_SHIFT)) & CAAM_PX_SMAPR_PG0_G1_TDO_MASK)

