Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_PX_SMAPR_PG0_G1_SMBLOB_MASK         (0x8U)
#define CAAM_PX_SMAPR_PG0_G1_SMBLOB_SHIFT        (3U)
/*! G1_SMBLOB
 *  0b0..Exporting or importing Secure Memory Blobs is prohibited, unless done via a Trusted Descriptor and G1_TDO=1.
 *  0b1..Exporting or importing Secure Memory Blobs is allowed, regardless of the G1_READ and G1_WRITE settings.
 */
#define CAAM_PX_SMAPR_PG0_G1_SMBLOB(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G1_SMBLOB_SHIFT)) & CAAM_PX_SMAPR_PG0_G1_SMBLOB_MASK)

#define CAAM_PX_SMAPR_PG0_G2_READ_MASK           (0x10U)
#define CAAM_PX_SMAPR_PG0_G2_READ_SHIFT          (4U)
/*! G2_READ
 *  0b0..Instruction fetches and reads are prohibited (except that Trusted Descriptor reads (if G2_TDO=1) and
 *       key-reads are always allowed, and exporting Secure Memory Blobs is allowed if G2_SMBLOB=1 or if done by a
 *       Trusted Descriptor and G2_TDO=1).
 *  0b1..Instruction fetches and reads are allowed (but exporting a Secure Memory Blob is prohibited if
 *       G2_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G2_TDO=0).
 */
#define CAAM_PX_SMAPR_PG0_G2_READ(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G2_READ_SHIFT)) & CAAM_PX_SMAPR_PG0_G2_READ_MASK)

#define CAAM_PX_SMAPR_PG0_G2_WRITE_MASK          (0x20U)
#define CAAM_PX_SMAPR_PG0_G2_WRITE_SHIFT         (5U)
/*! G2_WRITE
 *  0b0..Writes are prohibited (except that Trusted Descriptor writes are allowed, and importing Secure Memory
 *       Blobs is allowed if G2_SMBLOB=1 or if done by a Trusted Descriptor and G2_TDO=1).
 *  0b1..Writes are allowed (but importing a Secure Memory Blob is prohibited if G2_SMBLOB=0 and the descriptor is
 *       not a Trusted Descriptor or if G2_TDO=0).
 */
#define CAAM_PX_SMAPR_PG0_G2_WRITE(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G2_WRITE_SHIFT)) & CAAM_PX_SMAPR_PG0_G2_WRITE_MASK)

#define CAAM_PX_SMAPR_PG0_G2_TDO_MASK            (0x40U)
#define CAAM_PX_SMAPR_PG0_G2_TDO_SHIFT           (6U)
/*! G2_TDO
 *  0b0..Trusted Descriptors have the same access privileges as Job Descriptors
 *  0b1..Trusted Descriptors are allowed to override the other access permissions, i.e. they can export blobs from
 *       or import blobs to the partition and read from and write to the partition regardless of the G2_SMBLOB,
 *       G2_WRITE and G2_READ settings.
 */
#define CAAM_PX_SMAPR_PG0_G2_TDO(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G2_TDO_SHIFT)) & CAAM_PX_SMAPR_PG0_G2_TDO_MASK)

#define CAAM_PX_SMAPR_PG0_G2_SMBLOB_MASK         (0x80U)
#define CAAM_PX_SMAPR_PG0_G2_SMBLOB_SHIFT        (7U)
/*! G2_SMBLOB
 *  0b0..Exporting or importing Secure Memory Blobs is prohibited, unless done via a Trusted Descriptor and G2_TDO=1.
 *  0b1..Exporting or importing Secure Memory Blobs is allowed, regardless of the G2_READ and G2_WRITE settings.
 */
#define CAAM_PX_SMAPR_PG0_G2_SMBLOB(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_G2_SMBLOB_SHIFT)) & CAAM_PX_SMAPR_PG0_G2_SMBLOB_MASK)

#define CAAM_PX_SMAPR_PG0_SMAG_LCK_MASK          (0x1000U)
#define CAAM_PX_SMAPR_PG0_SMAG_LCK_SHIFT         (12U)
/*! SMAG_LCK
 *  0b0..The SMAG2JR register and SMAG1JR register are unlocked. The partition owner can change any writable bits of these registers.
 *  0b1..The SMAG2JR register and SMAG1JR register are locked. The SMAG2JR and SMAG1JR registers cannot be changed
 *       until the partition is de-allocated or a POR occurs.
 */
#define CAAM_PX_SMAPR_PG0_SMAG_LCK(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_SMAG_LCK_SHIFT)) & CAAM_PX_SMAPR_PG0_SMAG_LCK_MASK)

#define CAAM_PX_SMAPR_PG0_SMAP_LCK_MASK          (0x2000U)
#define CAAM_PX_SMAPR_PG0_SMAP_LCK_SHIFT         (13U)
/*! SMAP_LCK
 *  0b0..The SMAP register is unlocked. The partition owner can change any writable bits of the SMAP register.
 *  0b1..The SMAP register is locked. The SMAP_LCK, CSP and PSP bits and G1 and G2 permission bits of the SMAP
 *       register cannot be changed until the partition is de-allocated or a POR occurs. The PARTITION_KMOD value can
 *       still be changed. The SMAG_LCK bit can be changed to a 1, but cannot be changed to a 0.
 */
#define CAAM_PX_SMAPR_PG0_SMAP_LCK(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_SMAP_LCK_SHIFT)) & CAAM_PX_SMAPR_PG0_SMAP_LCK_MASK)

#define CAAM_PX_SMAPR_PG0_PSP_MASK               (0x4000U)
#define CAAM_PX_SMAPR_PG0_PSP_SHIFT              (14U)
/*! PSP
 *  0b0..The partition and any of the pages allocated to the partition can be de-allocated.
 *  0b1..The partition cannot be de-allocated and the pages allocated to the partition cannot be de-allocated.
 */
#define CAAM_PX_SMAPR_PG0_PSP(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_PSP_SHIFT)) & CAAM_PX_SMAPR_PG0_PSP_MASK)

#define CAAM_PX_SMAPR_PG0_CSP_MASK               (0x8000U)
#define CAAM_PX_SMAPR_PG0_CSP_SHIFT              (15U)
/*! CSP
 *  0b0..The pages allocated to the partition will not be zeroized when they are de-allocated or the partition is
 *       released or a security alarm occurs.
 *  0b1..The pages allocated to the partition will be zeroized when they are individually de-allocated or the
 *       partition is released or a security alarm occurs.
 */
#define CAAM_PX_SMAPR_PG0_CSP(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_CSP_SHIFT)) & CAAM_PX_SMAPR_PG0_CSP_MASK)

#define CAAM_PX_SMAPR_PG0_PARTITION_KMOD_MASK    (0xFFFF0000U)
#define CAAM_PX_SMAPR_PG0_PARTITION_KMOD_SHIFT   (16U)
#define CAAM_PX_SMAPR_PG0_PARTITION_KMOD(x)      (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_PG0_PARTITION_KMOD_SHIFT)) & CAAM_PX_SMAPR_PG0_PARTITION_KMOD_MASK)
/*! @} */

/* The count of CAAM_PX_SMAPR_PG0 */
#define CAAM_PX_SMAPR_PG0_COUNT                  (16U)

/*! @name PX_SMAG2_PG0 - Secure Memory Access Group Registers */
/*! @{ */

#define CAAM_PX_SMAG2_PG0_Gx_ID00_MASK           (0x1U)
#define CAAM_PX_SMAG2_PG0_Gx_ID00_SHIFT          (0U)
#define CAAM_PX_SMAG2_PG0_Gx_ID00(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID00_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID00_MASK)

