Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_PX_SMAG1_PG0_Gx_ID17_MASK           (0x20000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID17_SHIFT          (17U)
#define CAAM_PX_SMAG1_PG0_Gx_ID17(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID17_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID17_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID18_MASK           (0x40000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID18_SHIFT          (18U)
#define CAAM_PX_SMAG1_PG0_Gx_ID18(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID18_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID18_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID19_MASK           (0x80000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID19_SHIFT          (19U)
#define CAAM_PX_SMAG1_PG0_Gx_ID19(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID19_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID19_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID20_MASK           (0x100000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID20_SHIFT          (20U)
#define CAAM_PX_SMAG1_PG0_Gx_ID20(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID20_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID20_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID21_MASK           (0x200000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID21_SHIFT          (21U)
#define CAAM_PX_SMAG1_PG0_Gx_ID21(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID21_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID21_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID22_MASK           (0x400000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID22_SHIFT          (22U)
#define CAAM_PX_SMAG1_PG0_Gx_ID22(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID22_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID22_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID23_MASK           (0x800000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID23_SHIFT          (23U)
#define CAAM_PX_SMAG1_PG0_Gx_ID23(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID23_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID23_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID24_MASK           (0x1000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID24_SHIFT          (24U)
#define CAAM_PX_SMAG1_PG0_Gx_ID24(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID24_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID24_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID25_MASK           (0x2000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID25_SHIFT          (25U)
#define CAAM_PX_SMAG1_PG0_Gx_ID25(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID25_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID25_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID26_MASK           (0x4000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID26_SHIFT          (26U)
#define CAAM_PX_SMAG1_PG0_Gx_ID26(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID26_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID26_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID27_MASK           (0x8000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID27_SHIFT          (27U)
#define CAAM_PX_SMAG1_PG0_Gx_ID27(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID27_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID27_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID28_MASK           (0x10000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID28_SHIFT          (28U)
#define CAAM_PX_SMAG1_PG0_Gx_ID28(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID28_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID28_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID29_MASK           (0x20000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID29_SHIFT          (29U)
#define CAAM_PX_SMAG1_PG0_Gx_ID29(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID29_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID29_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID30_MASK           (0x40000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID30_SHIFT          (30U)
#define CAAM_PX_SMAG1_PG0_Gx_ID30(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID30_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID30_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID31_MASK           (0x80000000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID31_SHIFT          (31U)
#define CAAM_PX_SMAG1_PG0_Gx_ID31(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID31_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID31_MASK)
/*! @} */

/* The count of CAAM_PX_SMAG1_PG0 */
#define CAAM_PX_SMAG1_PG0_COUNT                  (16U)

/*! @name REIS - Recoverable Error Interrupt Status */
/*! @{ */

#define CAAM_REIS_CWDE_MASK                      (0x1U)
#define CAAM_REIS_CWDE_SHIFT                     (0U)
#define CAAM_REIS_CWDE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIS_CWDE_SHIFT)) & CAAM_REIS_CWDE_MASK)

#define CAAM_REIS_RBAE_MASK                      (0x10000U)
#define CAAM_REIS_RBAE_SHIFT                     (16U)
#define CAAM_REIS_RBAE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIS_RBAE_SHIFT)) & CAAM_REIS_RBAE_MASK)

#define CAAM_REIS_JBAE0_MASK                     (0x1000000U)
#define CAAM_REIS_JBAE0_SHIFT                    (24U)
#define CAAM_REIS_JBAE0(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIS_JBAE0_SHIFT)) & CAAM_REIS_JBAE0_MASK)

#define CAAM_REIS_JBAE1_MASK                     (0x2000000U)
#define CAAM_REIS_JBAE1_SHIFT                    (25U)
#define CAAM_REIS_JBAE1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIS_JBAE1_SHIFT)) & CAAM_REIS_JBAE1_MASK)

#define CAAM_REIS_JBAE2_MASK                     (0x4000000U)
#define CAAM_REIS_JBAE2_SHIFT                    (26U)
#define CAAM_REIS_JBAE2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIS_JBAE2_SHIFT)) & CAAM_REIS_JBAE2_MASK)

#define CAAM_REIS_JBAE3_MASK                     (0x8000000U)
#define CAAM_REIS_JBAE3_SHIFT                    (27U)
#define CAAM_REIS_JBAE3(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIS_JBAE3_SHIFT)) & CAAM_REIS_JBAE3_MASK)
/*! @} */

/*! @name REIE - Recoverable Error Interrupt Enable */
/*! @{ */

#define CAAM_REIE_CWDE_MASK                      (0x1U)
#define CAAM_REIE_CWDE_SHIFT                     (0U)
#define CAAM_REIE_CWDE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIE_CWDE_SHIFT)) & CAAM_REIE_CWDE_MASK)

#define CAAM_REIE_RBAE_MASK                      (0x10000U)
#define CAAM_REIE_RBAE_SHIFT                     (16U)
#define CAAM_REIE_RBAE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIE_RBAE_SHIFT)) & CAAM_REIE_RBAE_MASK)

#define CAAM_REIE_JBAE0_MASK                     (0x1000000U)
#define CAAM_REIE_JBAE0_SHIFT                    (24U)
#define CAAM_REIE_JBAE0(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIE_JBAE0_SHIFT)) & CAAM_REIE_JBAE0_MASK)

#define CAAM_REIE_JBAE1_MASK                     (0x2000000U)
#define CAAM_REIE_JBAE1_SHIFT                    (25U)
#define CAAM_REIE_JBAE1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIE_JBAE1_SHIFT)) & CAAM_REIE_JBAE1_MASK)

#define CAAM_REIE_JBAE2_MASK                     (0x4000000U)
#define CAAM_REIE_JBAE2_SHIFT                    (26U)
#define CAAM_REIE_JBAE2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIE_JBAE2_SHIFT)) & CAAM_REIE_JBAE2_MASK)

#define CAAM_REIE_JBAE3_MASK                     (0x8000000U)
#define CAAM_REIE_JBAE3_SHIFT                    (27U)
#define CAAM_REIE_JBAE3(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIE_JBAE3_SHIFT)) & CAAM_REIE_JBAE3_MASK)
/*! @} */

