Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
/*! @name REIF - Recoverable Error Interrupt Force */
/*! @{ */

#define CAAM_REIF_CWDE_MASK                      (0x1U)
#define CAAM_REIF_CWDE_SHIFT                     (0U)
#define CAAM_REIF_CWDE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIF_CWDE_SHIFT)) & CAAM_REIF_CWDE_MASK)

#define CAAM_REIF_RBAE_MASK                      (0x10000U)
#define CAAM_REIF_RBAE_SHIFT                     (16U)
#define CAAM_REIF_RBAE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIF_RBAE_SHIFT)) & CAAM_REIF_RBAE_MASK)

#define CAAM_REIF_JBAE0_MASK                     (0x1000000U)
#define CAAM_REIF_JBAE0_SHIFT                    (24U)
#define CAAM_REIF_JBAE0(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIF_JBAE0_SHIFT)) & CAAM_REIF_JBAE0_MASK)

#define CAAM_REIF_JBAE1_MASK                     (0x2000000U)
#define CAAM_REIF_JBAE1_SHIFT                    (25U)
#define CAAM_REIF_JBAE1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIF_JBAE1_SHIFT)) & CAAM_REIF_JBAE1_MASK)

#define CAAM_REIF_JBAE2_MASK                     (0x4000000U)
#define CAAM_REIF_JBAE2_SHIFT                    (26U)
#define CAAM_REIF_JBAE2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIF_JBAE2_SHIFT)) & CAAM_REIF_JBAE2_MASK)

#define CAAM_REIF_JBAE3_MASK                     (0x8000000U)
#define CAAM_REIF_JBAE3_SHIFT                    (27U)
#define CAAM_REIF_JBAE3(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIF_JBAE3_SHIFT)) & CAAM_REIF_JBAE3_MASK)
/*! @} */

/*! @name REIH - Recoverable Error Interrupt Halt */
/*! @{ */

#define CAAM_REIH_CWDE_MASK                      (0x1U)
#define CAAM_REIH_CWDE_SHIFT                     (0U)
/*! CWDE
 *  0b0..Don't halt CAAM if CAAM watchdog expired.
 *  0b1..Halt CAAM if CAAM watchdog expired..
 */
#define CAAM_REIH_CWDE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIH_CWDE_SHIFT)) & CAAM_REIH_CWDE_MASK)

#define CAAM_REIH_RBAE_MASK                      (0x10000U)
#define CAAM_REIH_RBAE_SHIFT                     (16U)
/*! RBAE
 *  0b0..Don't halt CAAM if RTIC-initiated job execution caused bus access error.
 *  0b1..Halt CAAM if RTIC-initiated job execution caused bus access error.
 */
#define CAAM_REIH_RBAE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REIH_RBAE_SHIFT)) & CAAM_REIH_RBAE_MASK)

#define CAAM_REIH_JBAE0_MASK                     (0x1000000U)
#define CAAM_REIH_JBAE0_SHIFT                    (24U)
/*! JBAE0
 *  0b0..Don't halt CAAM if JR0-initiated job execution caused bus access error.
 *  0b1..Halt CAAM if JR0-initiated job execution caused bus access error.
 */
#define CAAM_REIH_JBAE0(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIH_JBAE0_SHIFT)) & CAAM_REIH_JBAE0_MASK)

#define CAAM_REIH_JBAE1_MASK                     (0x2000000U)
#define CAAM_REIH_JBAE1_SHIFT                    (25U)
/*! JBAE1
 *  0b0..Don't halt CAAM if JR1-initiated job execution caused bus access error.
 *  0b1..Halt CAAM if JR1-initiated job execution caused bus access error.
 */
#define CAAM_REIH_JBAE1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIH_JBAE1_SHIFT)) & CAAM_REIH_JBAE1_MASK)

#define CAAM_REIH_JBAE2_MASK                     (0x4000000U)
#define CAAM_REIH_JBAE2_SHIFT                    (26U)
/*! JBAE2
 *  0b0..Don't halt CAAM if JR2-initiated job execution caused bus access error.
 *  0b1..Halt CAAM if JR2-initiated job execution caused bus access error.
 */
#define CAAM_REIH_JBAE2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIH_JBAE2_SHIFT)) & CAAM_REIH_JBAE2_MASK)

#define CAAM_REIH_JBAE3_MASK                     (0x8000000U)
#define CAAM_REIH_JBAE3_SHIFT                    (27U)
/*! JBAE3
 *  0b0..Don't halt CAAM if JR3-initiated job execution caused bus access error.
 *  0b1..Halt CAAM if JR3-initiated job execution caused bus access error.
 */
#define CAAM_REIH_JBAE3(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_REIH_JBAE3_SHIFT)) & CAAM_REIH_JBAE3_MASK)
/*! @} */

/*! @name SMWPJRR - Secure Memory Write Protect Job Ring Register */
/*! @{ */

#define CAAM_SMWPJRR_SMR_WP_JRa_MASK             (0x1U)
#define CAAM_SMWPJRR_SMR_WP_JRa_SHIFT            (0U)
#define CAAM_SMWPJRR_SMR_WP_JRa(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_SMWPJRR_SMR_WP_JRa_SHIFT)) & CAAM_SMWPJRR_SMR_WP_JRa_MASK)
/*! @} */

/* The count of CAAM_SMWPJRR */
#define CAAM_SMWPJRR_COUNT                       (4U)

/*! @name SMCR_PG0 - Secure Memory Command Register */
/*! @{ */

#define CAAM_SMCR_PG0_CMD_MASK                   (0xFU)
#define CAAM_SMCR_PG0_CMD_SHIFT                  (0U)
#define CAAM_SMCR_PG0_CMD(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SMCR_PG0_CMD_SHIFT)) & CAAM_SMCR_PG0_CMD_MASK)

#define CAAM_SMCR_PG0_PRTN_MASK                  (0xF00U)
#define CAAM_SMCR_PG0_PRTN_SHIFT                 (8U)
#define CAAM_SMCR_PG0_PRTN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMCR_PG0_PRTN_SHIFT)) & CAAM_SMCR_PG0_PRTN_MASK)

#define CAAM_SMCR_PG0_PAGE_MASK                  (0xFFFF0000U)
#define CAAM_SMCR_PG0_PAGE_SHIFT                 (16U)
#define CAAM_SMCR_PG0_PAGE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMCR_PG0_PAGE_SHIFT)) & CAAM_SMCR_PG0_PAGE_MASK)
/*! @} */

/*! @name SMCSR_PG0 - Secure Memory Command Status Register */
/*! @{ */

#define CAAM_SMCSR_PG0_PRTN_MASK                 (0xFU)
#define CAAM_SMCSR_PG0_PRTN_SHIFT                (0U)
#define CAAM_SMCSR_PG0_PRTN(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_PG0_PRTN_SHIFT)) & CAAM_SMCSR_PG0_PRTN_MASK)

#define CAAM_SMCSR_PG0_PO_MASK                   (0xC0U)
#define CAAM_SMCSR_PG0_PO_SHIFT                  (6U)
/*! PO
 *  0b00..Available; Unowned: The entity that issued the inquiry may allocate this page to a partition. No
 *        zeroization is needed since it has already been cleared, therefore no interrupt should be expected.
 *  0b01..Page does not exist in this version or is not initialized yet.
 *  0b10..Another entity owns the page. This page is unavailable to the issuer of the inquiry.
 *  0b11..Owned by the entity making the inquiry. The owner may de-allocate this page if its partition is not
 *        marked PSP. If the partition to which the page is allocated is designated as CSP, the page will be zeroized
 *        upon de-allocation.
 */
#define CAAM_SMCSR_PG0_PO(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_PG0_PO_SHIFT)) & CAAM_SMCSR_PG0_PO_MASK)

#define CAAM_SMCSR_PG0_AERR_MASK                 (0x3000U)
#define CAAM_SMCSR_PG0_AERR_SHIFT                (12U)
#define CAAM_SMCSR_PG0_AERR(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_PG0_AERR_SHIFT)) & CAAM_SMCSR_PG0_AERR_MASK)

#define CAAM_SMCSR_PG0_CERR_MASK                 (0xC000U)
#define CAAM_SMCSR_PG0_CERR_SHIFT                (14U)
/*! CERR
 *  0b00..No Error.
 *  0b01..Command has not yet completed.
 *  0b10..A security failure occurred.
 *  0b11..Command Overflow. Another command was issued by the same Job Ring owner before the owner's previous
 *        command completed. The additional command was ignored.
 */
#define CAAM_SMCSR_PG0_CERR(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_PG0_CERR_SHIFT)) & CAAM_SMCSR_PG0_CERR_MASK)

#define CAAM_SMCSR_PG0_PAGE_MASK                 (0xFFF0000U)
#define CAAM_SMCSR_PG0_PAGE_SHIFT                (16U)
#define CAAM_SMCSR_PG0_PAGE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_PG0_PAGE_SHIFT)) & CAAM_SMCSR_PG0_PAGE_MASK)
/*! @} */

/*! @name CAAMVID_MS_TRAD - CAAM Version ID Register, most-significant half */
/*! @{ */

#define CAAM_CAAMVID_MS_TRAD_MIN_REV_MASK        (0xFFU)
#define CAAM_CAAMVID_MS_TRAD_MIN_REV_SHIFT       (0U)
#define CAAM_CAAMVID_MS_TRAD_MIN_REV(x)          (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_MS_TRAD_MIN_REV_SHIFT)) & CAAM_CAAMVID_MS_TRAD_MIN_REV_MASK)

#define CAAM_CAAMVID_MS_TRAD_MAJ_REV_MASK        (0xFF00U)
#define CAAM_CAAMVID_MS_TRAD_MAJ_REV_SHIFT       (8U)
#define CAAM_CAAMVID_MS_TRAD_MAJ_REV(x)          (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_MS_TRAD_MAJ_REV_SHIFT)) & CAAM_CAAMVID_MS_TRAD_MAJ_REV_MASK)

#define CAAM_CAAMVID_MS_TRAD_IP_ID_MASK          (0xFFFF0000U)
#define CAAM_CAAMVID_MS_TRAD_IP_ID_SHIFT         (16U)
#define CAAM_CAAMVID_MS_TRAD_IP_ID(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_MS_TRAD_IP_ID_SHIFT)) & CAAM_CAAMVID_MS_TRAD_IP_ID_MASK)
/*! @} */

/*! @name CAAMVID_LS_TRAD - CAAM Version ID Register, least-significant half */
/*! @{ */

#define CAAM_CAAMVID_LS_TRAD_CONFIG_OPT_MASK     (0xFFU)
#define CAAM_CAAMVID_LS_TRAD_CONFIG_OPT_SHIFT    (0U)
#define CAAM_CAAMVID_LS_TRAD_CONFIG_OPT(x)       (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_LS_TRAD_CONFIG_OPT_SHIFT)) & CAAM_CAAMVID_LS_TRAD_CONFIG_OPT_MASK)

#define CAAM_CAAMVID_LS_TRAD_ECO_REV_MASK        (0xFF00U)
#define CAAM_CAAMVID_LS_TRAD_ECO_REV_SHIFT       (8U)
#define CAAM_CAAMVID_LS_TRAD_ECO_REV(x)          (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_LS_TRAD_ECO_REV_SHIFT)) & CAAM_CAAMVID_LS_TRAD_ECO_REV_MASK)

#define CAAM_CAAMVID_LS_TRAD_INTG_OPT_MASK       (0xFF0000U)
#define CAAM_CAAMVID_LS_TRAD_INTG_OPT_SHIFT      (16U)
#define CAAM_CAAMVID_LS_TRAD_INTG_OPT(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_LS_TRAD_INTG_OPT_SHIFT)) & CAAM_CAAMVID_LS_TRAD_INTG_OPT_MASK)

#define CAAM_CAAMVID_LS_TRAD_COMPILE_OPT_MASK    (0xFF000000U)
#define CAAM_CAAMVID_LS_TRAD_COMPILE_OPT_SHIFT   (24U)
#define CAAM_CAAMVID_LS_TRAD_COMPILE_OPT(x)      (((uint32_t)(((uint32_t)(x)) << CAAM_CAAMVID_LS_TRAD_COMPILE_OPT_SHIFT)) & CAAM_CAAMVID_LS_TRAD_COMPILE_OPT_MASK)
/*! @} */

/*! @name HT_JD_ADDR - Holding Tank 0 Job Descriptor Address */
/*! @{ */

