Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_SMSTA_DID_MASK                      (0xF00U)
#define CAAM_SMSTA_DID_SHIFT                     (8U)
#define CAAM_SMSTA_DID(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_DID_SHIFT)) & CAAM_SMSTA_DID_MASK)

#define CAAM_SMSTA_NS_MASK                       (0x1000U)
#define CAAM_SMSTA_NS_SHIFT                      (12U)
#define CAAM_SMSTA_NS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_NS_SHIFT)) & CAAM_SMSTA_NS_MASK)

#define CAAM_SMSTA_SMR_WP_MASK                   (0x8000U)
#define CAAM_SMSTA_SMR_WP_SHIFT                  (15U)
#define CAAM_SMSTA_SMR_WP(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_SMR_WP_SHIFT)) & CAAM_SMSTA_SMR_WP_MASK)

#define CAAM_SMSTA_PAGE_MASK                     (0x7FF0000U)
#define CAAM_SMSTA_PAGE_SHIFT                    (16U)
#define CAAM_SMSTA_PAGE(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_PAGE_SHIFT)) & CAAM_SMSTA_PAGE_MASK)

#define CAAM_SMSTA_PART_MASK                     (0xF0000000U)
#define CAAM_SMSTA_PART_SHIFT                    (28U)
#define CAAM_SMSTA_PART(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_PART_SHIFT)) & CAAM_SMSTA_PART_MASK)
/*! @} */

/*! @name SMPO - Secure Memory Partition Owners Register */
/*! @{ */

#define CAAM_SMPO_PO0_MASK                       (0x3U)
#define CAAM_SMPO_PO0_SHIFT                      (0U)
/*! PO0
 *  0b00..Available; Unowned. A Job Ring owner may claim partition 0 by writing to the appropriate SMAPJR register
 *        address alias. Note that the entire register will return all 0s if read by a entity that does not own
 *        the Job Ring associated with the SMPO address alias that was read.
 *  0b01..Partition 0 does not exist in this version
 *  0b10..Another entity owns partition 0. Partition 0 is unavailable to the reader. If the reader attempts to
 *        de-allocate partition 0 or write to the SMAPJR register or SMAGJR register for partition 0 or allocate a
 *        page to or de-allocate a page from partition 0 the command will be ignored. (Note that if a CSP partition is
 *        de-allocated, all entities (including the owner that de-allocated the partition) will see a 0b10 value
 *        for that partition until all its pages have been zeroized.)
 *  0b11..The entity that read the SMPO register owns partition 0. Ownership is claimed when the access
 *        permissions register (SMAPJR) of an available partition is first written.
 */
#define CAAM_SMPO_PO0(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO0_SHIFT)) & CAAM_SMPO_PO0_MASK)

#define CAAM_SMPO_PO1_MASK                       (0xCU)
#define CAAM_SMPO_PO1_SHIFT                      (2U)
#define CAAM_SMPO_PO1(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO1_SHIFT)) & CAAM_SMPO_PO1_MASK)

#define CAAM_SMPO_PO2_MASK                       (0x30U)
#define CAAM_SMPO_PO2_SHIFT                      (4U)
#define CAAM_SMPO_PO2(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO2_SHIFT)) & CAAM_SMPO_PO2_MASK)

#define CAAM_SMPO_PO3_MASK                       (0xC0U)
#define CAAM_SMPO_PO3_SHIFT                      (6U)
#define CAAM_SMPO_PO3(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO3_SHIFT)) & CAAM_SMPO_PO3_MASK)

#define CAAM_SMPO_PO4_MASK                       (0x300U)
#define CAAM_SMPO_PO4_SHIFT                      (8U)
#define CAAM_SMPO_PO4(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO4_SHIFT)) & CAAM_SMPO_PO4_MASK)

#define CAAM_SMPO_PO5_MASK                       (0xC00U)
#define CAAM_SMPO_PO5_SHIFT                      (10U)
#define CAAM_SMPO_PO5(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO5_SHIFT)) & CAAM_SMPO_PO5_MASK)

#define CAAM_SMPO_PO6_MASK                       (0x3000U)
#define CAAM_SMPO_PO6_SHIFT                      (12U)
#define CAAM_SMPO_PO6(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO6_SHIFT)) & CAAM_SMPO_PO6_MASK)

#define CAAM_SMPO_PO7_MASK                       (0xC000U)
#define CAAM_SMPO_PO7_SHIFT                      (14U)
#define CAAM_SMPO_PO7(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO7_SHIFT)) & CAAM_SMPO_PO7_MASK)

#define CAAM_SMPO_PO8_MASK                       (0x30000U)
#define CAAM_SMPO_PO8_SHIFT                      (16U)
#define CAAM_SMPO_PO8(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO8_SHIFT)) & CAAM_SMPO_PO8_MASK)

#define CAAM_SMPO_PO9_MASK                       (0xC0000U)
#define CAAM_SMPO_PO9_SHIFT                      (18U)
#define CAAM_SMPO_PO9(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO9_SHIFT)) & CAAM_SMPO_PO9_MASK)

#define CAAM_SMPO_PO10_MASK                      (0x300000U)
#define CAAM_SMPO_PO10_SHIFT                     (20U)
#define CAAM_SMPO_PO10(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO10_SHIFT)) & CAAM_SMPO_PO10_MASK)

#define CAAM_SMPO_PO11_MASK                      (0xC00000U)
#define CAAM_SMPO_PO11_SHIFT                     (22U)
#define CAAM_SMPO_PO11(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO11_SHIFT)) & CAAM_SMPO_PO11_MASK)

#define CAAM_SMPO_PO12_MASK                      (0x3000000U)
#define CAAM_SMPO_PO12_SHIFT                     (24U)
#define CAAM_SMPO_PO12(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO12_SHIFT)) & CAAM_SMPO_PO12_MASK)

#define CAAM_SMPO_PO13_MASK                      (0xC000000U)
#define CAAM_SMPO_PO13_SHIFT                     (26U)
#define CAAM_SMPO_PO13(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO13_SHIFT)) & CAAM_SMPO_PO13_MASK)

#define CAAM_SMPO_PO14_MASK                      (0x30000000U)
#define CAAM_SMPO_PO14_SHIFT                     (28U)
#define CAAM_SMPO_PO14(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO14_SHIFT)) & CAAM_SMPO_PO14_MASK)

#define CAAM_SMPO_PO15_MASK                      (0xC0000000U)
#define CAAM_SMPO_PO15_SHIFT                     (30U)
#define CAAM_SMPO_PO15(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_SMPO_PO15_SHIFT)) & CAAM_SMPO_PO15_MASK)
/*! @} */

/*! @name FAR - Fault Address Register */
/*! @{ */

