Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
/* The count of CAAM_IRJAR_JR */
#define CAAM_IRJAR_JR_COUNT                      (4U)

/*! @name ORBAR_JR - Output Ring Base Address Register for Job Ring 0..Output Ring Base Address Register for Job Ring 3 */
/*! @{ */

#define CAAM_ORBAR_JR_ORBA_MASK                  (0xFFFFFFFFFU)
#define CAAM_ORBAR_JR_ORBA_SHIFT                 (0U)
#define CAAM_ORBAR_JR_ORBA(x)                    (((uint64_t)(((uint64_t)(x)) << CAAM_ORBAR_JR_ORBA_SHIFT)) & CAAM_ORBAR_JR_ORBA_MASK)
/*! @} */

/* The count of CAAM_ORBAR_JR */
#define CAAM_ORBAR_JR_COUNT                      (4U)

/*! @name ORSR_JR - Output Ring Size Register for Job Ring 0..Output Ring Size Register for Job Ring 3 */
/*! @{ */

#define CAAM_ORSR_JR_ORS_MASK                    (0x3FFU)
#define CAAM_ORSR_JR_ORS_SHIFT                   (0U)
#define CAAM_ORSR_JR_ORS(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_ORSR_JR_ORS_SHIFT)) & CAAM_ORSR_JR_ORS_MASK)
/*! @} */

/* The count of CAAM_ORSR_JR */
#define CAAM_ORSR_JR_COUNT                       (4U)

/*! @name ORJRR_JR - Output Ring Jobs Removed Register for Job Ring 0..Output Ring Jobs Removed Register for Job Ring 3 */
/*! @{ */

#define CAAM_ORJRR_JR_ORJR_MASK                  (0x3FFU)
#define CAAM_ORJRR_JR_ORJR_SHIFT                 (0U)
#define CAAM_ORJRR_JR_ORJR(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_ORJRR_JR_ORJR_SHIFT)) & CAAM_ORJRR_JR_ORJR_MASK)
/*! @} */

/* The count of CAAM_ORJRR_JR */
#define CAAM_ORJRR_JR_COUNT                      (4U)

/*! @name ORSFR_JR - Output Ring Slots Full Register for Job Ring 0..Output Ring Slots Full Register for Job Ring 3 */
/*! @{ */

#define CAAM_ORSFR_JR_ORSF_MASK                  (0x3FFU)
#define CAAM_ORSFR_JR_ORSF_SHIFT                 (0U)
#define CAAM_ORSFR_JR_ORSF(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_ORSFR_JR_ORSF_SHIFT)) & CAAM_ORSFR_JR_ORSF_MASK)
/*! @} */

/* The count of CAAM_ORSFR_JR */
#define CAAM_ORSFR_JR_COUNT                      (4U)

/*! @name JRSTAR_JR - Job Ring Output Status Register for Job Ring 0..Job Ring Output Status Register for Job Ring 3 */
/*! @{ */

#define CAAM_JRSTAR_JR_SSED_MASK                 (0xFFFFFFFU)
#define CAAM_JRSTAR_JR_SSED_SHIFT                (0U)
#define CAAM_JRSTAR_JR_SSED(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_JRSTAR_JR_SSED_SHIFT)) & CAAM_JRSTAR_JR_SSED_MASK)

#define CAAM_JRSTAR_JR_SSRC_MASK                 (0xF0000000U)
#define CAAM_JRSTAR_JR_SSRC_SHIFT                (28U)
/*! SSRC
 *  0b0000..No Status Source (No Error or Status Reported)
 *  0b0001..Reserved
 *  0b0010..CCB Status Source (CCB Error Reported)
 *  0b0011..Jump Halt User Status Source (User-Provided Status Reported)
 *  0b0100..DECO Status Source (DECO Error Reported)
 *  0b0101..Reserved
 *  0b0110..Job Ring Status Source (Job Ring Error Reported)
 *  0b0111..Jump Halt Condition Codes (Condition Code Status Reported)
 */
#define CAAM_JRSTAR_JR_SSRC(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_JRSTAR_JR_SSRC_SHIFT)) & CAAM_JRSTAR_JR_SSRC_MASK)
/*! @} */

/* The count of CAAM_JRSTAR_JR */
#define CAAM_JRSTAR_JR_COUNT                     (4U)

/*! @name JRINTR_JR - Job Ring Interrupt Status Register for Job Ring 0..Job Ring Interrupt Status Register for Job Ring 3 */
/*! @{ */

#define CAAM_JRINTR_JR_JRI_MASK                  (0x1U)
#define CAAM_JRINTR_JR_JRI_SHIFT                 (0U)
#define CAAM_JRINTR_JR_JRI(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_JRI_SHIFT)) & CAAM_JRINTR_JR_JRI_MASK)

#define CAAM_JRINTR_JR_JRE_MASK                  (0x2U)
#define CAAM_JRINTR_JR_JRE_SHIFT                 (1U)
#define CAAM_JRINTR_JR_JRE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_JRE_SHIFT)) & CAAM_JRINTR_JR_JRE_MASK)

#define CAAM_JRINTR_JR_HALT_MASK                 (0xCU)
#define CAAM_JRINTR_JR_HALT_SHIFT                (2U)
#define CAAM_JRINTR_JR_HALT(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_HALT_SHIFT)) & CAAM_JRINTR_JR_HALT_MASK)

#define CAAM_JRINTR_JR_ENTER_FAIL_MASK           (0x10U)
#define CAAM_JRINTR_JR_ENTER_FAIL_SHIFT          (4U)
#define CAAM_JRINTR_JR_ENTER_FAIL(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_ENTER_FAIL_SHIFT)) & CAAM_JRINTR_JR_ENTER_FAIL_MASK)

#define CAAM_JRINTR_JR_EXIT_FAIL_MASK            (0x20U)
#define CAAM_JRINTR_JR_EXIT_FAIL_SHIFT           (5U)
#define CAAM_JRINTR_JR_EXIT_FAIL(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_EXIT_FAIL_SHIFT)) & CAAM_JRINTR_JR_EXIT_FAIL_MASK)

#define CAAM_JRINTR_JR_ERR_TYPE_MASK             (0x1F00U)
#define CAAM_JRINTR_JR_ERR_TYPE_SHIFT            (8U)
/*! ERR_TYPE
 *  0b00001..Error writing status to Output Ring
 *  0b00011..Bad input ring base address (not on a 4-byte boundary).
 *  0b00100..Bad output ring base address (not on a 4-byte boundary).
 *  0b00101..Invalid write to Input Ring Base Address Register or Input Ring Size Register. Can be written when
 *           there are no jobs in the input ring or when the Job Ring is halted. These are fatal and will likely
 *           result in not being able to get all jobs out into the output ring for processing by software. Resetting
 *           the job ring will almost certainly be necessary.
 *  0b00110..Invalid write to Output Ring Base Address Register or Output Ring Size Register. Can be written when
 *           there are no jobs in the output ring and no jobs from this queue are already processing in CAAM (in
 *           the holding tanks or DECOs), or when the Job Ring is halted.
 *  0b00111..Job Ring reset released before Job Ring is halted.
 *  0b01000..Removed too many jobs (ORJRR larger than ORSFR).
 *  0b01001..Added too many jobs (IRJAR larger than IRSAR).
 *  0b01010..Writing ORSF > ORS In these error cases the write is ignored, the interrupt is asserted (unless
 *           masked) and the error bit and error_type fields are set in the Job Ring Interrupt Status Register.
 *  0b01011..Writing IRSA > IRS
 *  0b01100..Writing ORWI > ORS in bytes
 *  0b01101..Writing IRRI > IRS in bytes
 *  0b01110..Writing IRSA when ring is active
 *  0b01111..Writing IRRI when ring is active
 *  0b10000..Writing ORSF when ring is active
 *  0b10001..Writing ORWI when ring is active
 */
#define CAAM_JRINTR_JR_ERR_TYPE(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_ERR_TYPE_SHIFT)) & CAAM_JRINTR_JR_ERR_TYPE_MASK)

#define CAAM_JRINTR_JR_ERR_ORWI_MASK             (0x3FFF0000U)
#define CAAM_JRINTR_JR_ERR_ORWI_SHIFT            (16U)
#define CAAM_JRINTR_JR_ERR_ORWI(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRINTR_JR_ERR_ORWI_SHIFT)) & CAAM_JRINTR_JR_ERR_ORWI_MASK)
/*! @} */

/* The count of CAAM_JRINTR_JR */
#define CAAM_JRINTR_JR_COUNT                     (4U)

