Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_RSTA_AE_MASK                        (0xF00U)
#define CAAM_RSTA_AE_SHIFT                       (8U)
/*! AE
 *  0b0000..All reads by RTIC were valid.
 *  0b0001..An illegal address was accessed by the RTIC
 */
#define CAAM_RSTA_AE(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_AE_SHIFT)) & CAAM_RSTA_AE_MASK)

#define CAAM_RSTA_WE_MASK                        (0x10000U)
#define CAAM_RSTA_WE_SHIFT                       (16U)
/*! WE
 *  0b0..No RTIC Watchdog timer error has occurred.
 *  0b1..RTIC Watchdog timer has expired prior to completing a round of hashing.
 */
#define CAAM_RSTA_WE(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_WE_SHIFT)) & CAAM_RSTA_WE_MASK)

#define CAAM_RSTA_ABH_MASK                       (0x20000U)
#define CAAM_RSTA_ABH_SHIFT                      (17U)
#define CAAM_RSTA_ABH(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_ABH_SHIFT)) & CAAM_RSTA_ABH_MASK)

#define CAAM_RSTA_HOD_MASK                       (0x40000U)
#define CAAM_RSTA_HOD_SHIFT                      (18U)
#define CAAM_RSTA_HOD(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_HOD_SHIFT)) & CAAM_RSTA_HOD_MASK)

#define CAAM_RSTA_RTD_MASK                       (0x80000U)
#define CAAM_RSTA_RTD_SHIFT                      (19U)
#define CAAM_RSTA_RTD(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_RTD_SHIFT)) & CAAM_RSTA_RTD_MASK)

#define CAAM_RSTA_CS_MASK                        (0x6000000U)
#define CAAM_RSTA_CS_SHIFT                       (25U)
/*! CS
 *  0b00..Idle State
 *  0b01..Single Hash State
 *  0b10..Run-time State
 *  0b11..Error State
 */
#define CAAM_RSTA_CS(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_CS_SHIFT)) & CAAM_RSTA_CS_MASK)
/*! @} */

/*! @name RCMD - RTIC Command Register */
/*! @{ */

#define CAAM_RCMD_CINT_MASK                      (0x1U)
#define CAAM_RCMD_CINT_SHIFT                     (0U)
/*! CINT
 *  0b0..Do not clear interrupt
 *  0b1..Clear interrupt. This bit cannot be modified during run-time checking mode
 */
#define CAAM_RCMD_CINT(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RCMD_CINT_SHIFT)) & CAAM_RCMD_CINT_MASK)

#define CAAM_RCMD_HO_MASK                        (0x2U)
#define CAAM_RCMD_HO_SHIFT                       (1U)
/*! HO
 *  0b0..Boot authentication disabled
 *  0b1..Authenticate code/generate reference hash value. This bit cannot be modified during run-time checking mode.
 */
#define CAAM_RCMD_HO(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RCMD_HO_SHIFT)) & CAAM_RCMD_HO_MASK)

#define CAAM_RCMD_RTC_MASK                       (0x4U)
#define CAAM_RCMD_RTC_SHIFT                      (2U)
/*! RTC
 *  0b0..Run-time checking disabled
 *  0b1..Verify run-time memory blocks continually
 */
#define CAAM_RCMD_RTC(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RCMD_RTC_SHIFT)) & CAAM_RCMD_RTC_MASK)

#define CAAM_RCMD_RTD_MASK                       (0x8U)
#define CAAM_RCMD_RTD_SHIFT                      (3U)
/*! RTD
 *  0b0..Allow Run Time Mode
 *  0b1..Prevent Run Time Mode
 */
#define CAAM_RCMD_RTD(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RCMD_RTD_SHIFT)) & CAAM_RCMD_RTD_MASK)
/*! @} */

/*! @name RCTL - RTIC Control Register */
/*! @{ */

#define CAAM_RCTL_IE_MASK                        (0x1U)
#define CAAM_RCTL_IE_SHIFT                       (0U)
/*! IE
 *  0b0..Interrupts disabled
 *  0b1..Interrupts enabled
 */
#define CAAM_RCTL_IE(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_IE_SHIFT)) & CAAM_RCTL_IE_MASK)

#define CAAM_RCTL_RREQS_MASK                     (0xEU)
#define CAAM_RCTL_RREQS_SHIFT                    (1U)
#define CAAM_RCTL_RREQS(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_RREQS_SHIFT)) & CAAM_RCTL_RREQS_MASK)

#define CAAM_RCTL_HOME_MASK                      (0xF0U)
#define CAAM_RCTL_HOME_SHIFT                     (4U)
#define CAAM_RCTL_HOME(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_HOME_SHIFT)) & CAAM_RCTL_HOME_MASK)

#define CAAM_RCTL_RTME_MASK                      (0xF00U)
#define CAAM_RCTL_RTME_SHIFT                     (8U)
#define CAAM_RCTL_RTME(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_RTME_SHIFT)) & CAAM_RCTL_RTME_MASK)

#define CAAM_RCTL_RTMU_MASK                      (0xF000U)
#define CAAM_RCTL_RTMU_SHIFT                     (12U)
#define CAAM_RCTL_RTMU(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_RTMU_SHIFT)) & CAAM_RCTL_RTMU_MASK)

#define CAAM_RCTL_RALG_MASK                      (0xF0000U)
#define CAAM_RCTL_RALG_SHIFT                     (16U)
#define CAAM_RCTL_RALG(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_RALG_SHIFT)) & CAAM_RCTL_RALG_MASK)

#define CAAM_RCTL_RIDLE_MASK                     (0x100000U)
#define CAAM_RCTL_RIDLE_SHIFT                    (20U)
#define CAAM_RCTL_RIDLE(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RCTL_RIDLE_SHIFT)) & CAAM_RCTL_RIDLE_MASK)
/*! @} */

/*! @name RTHR - RTIC Throttle Register */
/*! @{ */

#define CAAM_RTHR_RTHR_MASK                      (0xFFFFU)
#define CAAM_RTHR_RTHR_SHIFT                     (0U)
#define CAAM_RTHR_RTHR(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RTHR_RTHR_SHIFT)) & CAAM_RTHR_RTHR_MASK)
/*! @} */

/*! @name RWDOG - RTIC Watchdog Timer */
/*! @{ */

#define CAAM_RWDOG_RWDOG_MASK                    (0xFFFFFFFFU)
#define CAAM_RWDOG_RWDOG_SHIFT                   (0U)
#define CAAM_RWDOG_RWDOG(x)                      (((uint64_t)(((uint64_t)(x)) << CAAM_RWDOG_RWDOG_SHIFT)) & CAAM_RWDOG_RWDOG_MASK)
/*! @} */

/*! @name REND - RTIC Endian Register */
/*! @{ */

#define CAAM_REND_REPO_MASK                      (0xFU)
#define CAAM_REND_REPO_SHIFT                     (0U)
/*! REPO
 *  0b1xxx..Byte Swap Memory Block D
 *  0bx1xx..Byte Swap Memory Block C
 *  0bxx1x..Byte Swap Memory Block B
 *  0bxxx1..Byte Swap Memory Block A
 */
#define CAAM_REND_REPO(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REND_REPO_SHIFT)) & CAAM_REND_REPO_MASK)

