Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_REND_RBS_MASK                       (0xF0U)
#define CAAM_REND_RBS_SHIFT                      (4U)
/*! RBS
 *  0b1xxx..Byte Swap Memory Block D
 *  0bx1xx..Byte Swap Memory Block C
 *  0bxx1x..Byte Swap Memory Block B
 *  0bxxx1..Byte Swap Memory Block A
 */
#define CAAM_REND_RBS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_REND_RBS_SHIFT)) & CAAM_REND_RBS_MASK)

#define CAAM_REND_RHWS_MASK                      (0xF00U)
#define CAAM_REND_RHWS_SHIFT                     (8U)
/*! RHWS
 *  0b1xxx..Half-Word Swap Memory Block D
 *  0bx1xx..Half-Word Swap Memory Block C
 *  0bxx1x..Half-Word Swap Memory Block B
 *  0bxxx1..Half-Word Swap Memory Block A
 */
#define CAAM_REND_RHWS(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_REND_RHWS_SHIFT)) & CAAM_REND_RHWS_MASK)

#define CAAM_REND_RWS_MASK                       (0xF000U)
#define CAAM_REND_RWS_SHIFT                      (12U)
/*! RWS
 *  0b1xxx..Word Swap Memory Block D
 *  0bx1xx..Word Swap Memory Block C
 *  0bxx1x..Word Swap Memory Block B
 *  0bxxx1..Word Swap Memory Block A
 */
#define CAAM_REND_RWS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_REND_RWS_SHIFT)) & CAAM_REND_RWS_MASK)
/*! @} */

/*! @name RMA - RTIC Memory Block A Address 0 Register..RTIC Memory Block D Address 1 Register */
/*! @{ */

#define CAAM_RMA_MEMBLKADDR_MASK                 (0xFFFFFFFFFU)
#define CAAM_RMA_MEMBLKADDR_SHIFT                (0U)
#define CAAM_RMA_MEMBLKADDR(x)                   (((uint64_t)(((uint64_t)(x)) << CAAM_RMA_MEMBLKADDR_SHIFT)) & CAAM_RMA_MEMBLKADDR_MASK)
/*! @} */

/* The count of CAAM_RMA */
#define CAAM_RMA_COUNT                           (4U)

/* The count of CAAM_RMA */
#define CAAM_RMA_COUNT2                          (2U)

/*! @name RML - RTIC Memory Block A Length 0 Register..RTIC Memory Block D Length 1 Register */
/*! @{ */

#define CAAM_RML_MEMBLKLEN_MASK                  (0xFFFFFFFFU)
#define CAAM_RML_MEMBLKLEN_SHIFT                 (0U)
#define CAAM_RML_MEMBLKLEN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_RML_MEMBLKLEN_SHIFT)) & CAAM_RML_MEMBLKLEN_MASK)
/*! @} */

/* The count of CAAM_RML */
#define CAAM_RML_COUNT                           (4U)

/* The count of CAAM_RML */
#define CAAM_RML_COUNT2                          (2U)

/*! @name RMD - RTIC Memory Block A Big Endian Hash Result Word 0..RTIC Memory Block D Little Endian Hash Result Word 31 */
/*! @{ */

#define CAAM_RMD_RTIC_Hash_Result_MASK           (0xFFFFFFFFU)
#define CAAM_RMD_RTIC_Hash_Result_SHIFT          (0U)
#define CAAM_RMD_RTIC_Hash_Result(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RMD_RTIC_Hash_Result_SHIFT)) & CAAM_RMD_RTIC_Hash_Result_MASK)
/*! @} */

/* The count of CAAM_RMD */
#define CAAM_RMD_COUNT                           (4U)

/* The count of CAAM_RMD */
#define CAAM_RMD_COUNT2                          (2U)

/* The count of CAAM_RMD */
#define CAAM_RMD_COUNT3                          (32U)

/*! @name REIR0RTIC - Recoverable Error Interrupt Record 0 for RTIC */
/*! @{ */

#define CAAM_REIR0RTIC_TYPE_MASK                 (0x3000000U)
#define CAAM_REIR0RTIC_TYPE_SHIFT                (24U)
#define CAAM_REIR0RTIC_TYPE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_REIR0RTIC_TYPE_SHIFT)) & CAAM_REIR0RTIC_TYPE_MASK)

#define CAAM_REIR0RTIC_MISS_MASK                 (0x80000000U)
#define CAAM_REIR0RTIC_MISS_SHIFT                (31U)
#define CAAM_REIR0RTIC_MISS(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_REIR0RTIC_MISS_SHIFT)) & CAAM_REIR0RTIC_MISS_MASK)
/*! @} */

/*! @name REIR2RTIC - Recoverable Error Interrupt Record 2 for RTIC */
/*! @{ */

#define CAAM_REIR2RTIC_ADDR_MASK                 (0xFFFFFFFFFFFFFFFFU)
#define CAAM_REIR2RTIC_ADDR_SHIFT                (0U)
#define CAAM_REIR2RTIC_ADDR(x)                   (((uint64_t)(((uint64_t)(x)) << CAAM_REIR2RTIC_ADDR_SHIFT)) & CAAM_REIR2RTIC_ADDR_MASK)
/*! @} */

/*! @name REIR4RTIC - Recoverable Error Interrupt Record 4 for RTIC */
/*! @{ */

#define CAAM_REIR4RTIC_ICID_MASK                 (0x7FFU)
#define CAAM_REIR4RTIC_ICID_SHIFT                (0U)
#define CAAM_REIR4RTIC_ICID(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_ICID_SHIFT)) & CAAM_REIR4RTIC_ICID_MASK)

#define CAAM_REIR4RTIC_DID_MASK                  (0x7800U)
#define CAAM_REIR4RTIC_DID_SHIFT                 (11U)
#define CAAM_REIR4RTIC_DID(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_DID_SHIFT)) & CAAM_REIR4RTIC_DID_MASK)

#define CAAM_REIR4RTIC_AXCACHE_MASK              (0xF0000U)
#define CAAM_REIR4RTIC_AXCACHE_SHIFT             (16U)
#define CAAM_REIR4RTIC_AXCACHE(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_AXCACHE_SHIFT)) & CAAM_REIR4RTIC_AXCACHE_MASK)

#define CAAM_REIR4RTIC_AXPROT_MASK               (0x700000U)
#define CAAM_REIR4RTIC_AXPROT_SHIFT              (20U)
#define CAAM_REIR4RTIC_AXPROT(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_AXPROT_SHIFT)) & CAAM_REIR4RTIC_AXPROT_MASK)

#define CAAM_REIR4RTIC_RWB_MASK                  (0x800000U)
#define CAAM_REIR4RTIC_RWB_SHIFT                 (23U)
#define CAAM_REIR4RTIC_RWB(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_RWB_SHIFT)) & CAAM_REIR4RTIC_RWB_MASK)

#define CAAM_REIR4RTIC_ERR_MASK                  (0x30000000U)
#define CAAM_REIR4RTIC_ERR_SHIFT                 (28U)
#define CAAM_REIR4RTIC_ERR(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_ERR_SHIFT)) & CAAM_REIR4RTIC_ERR_MASK)

#define CAAM_REIR4RTIC_MIX_MASK                  (0xC0000000U)
#define CAAM_REIR4RTIC_MIX_SHIFT                 (30U)
#define CAAM_REIR4RTIC_MIX(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4RTIC_MIX_SHIFT)) & CAAM_REIR4RTIC_MIX_MASK)
/*! @} */

/*! @name REIR5RTIC - Recoverable Error Interrupt Record 5 for RTIC */
/*! @{ */

#define CAAM_REIR5RTIC_BID_MASK                  (0xF0000U)
#define CAAM_REIR5RTIC_BID_SHIFT                 (16U)
#define CAAM_REIR5RTIC_BID(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5RTIC_BID_SHIFT)) & CAAM_REIR5RTIC_BID_MASK)

