Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_CNFIFO_2_STYPE_MASK                 (0x3000000U)
#define CAAM_CNFIFO_2_STYPE_SHIFT                (24U)
#define CAAM_CNFIFO_2_STYPE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_STYPE_SHIFT)) & CAAM_CNFIFO_2_STYPE_MASK)

#define CAAM_CNFIFO_2_FC1_MASK                   (0x4000000U)
#define CAAM_CNFIFO_2_FC1_SHIFT                  (26U)
/*! FC1
 *  0b0..Don't flush the Class 1 data.
 *  0b1..Flush the Class 1 data.
 */
#define CAAM_CNFIFO_2_FC1(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_FC1_SHIFT)) & CAAM_CNFIFO_2_FC1_MASK)

#define CAAM_CNFIFO_2_FC2_MASK                   (0x8000000U)
#define CAAM_CNFIFO_2_FC2_SHIFT                  (27U)
/*! FC2
 *  0b0..Don't flush the Class 2 data.
 *  0b1..Flush the Class 2 data.
 */
#define CAAM_CNFIFO_2_FC2(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_FC2_SHIFT)) & CAAM_CNFIFO_2_FC2_MASK)

#define CAAM_CNFIFO_2_LC1_MASK                   (0x10000000U)
#define CAAM_CNFIFO_2_LC1_SHIFT                  (28U)
/*! LC1
 *  0b0..This is not the last Class 1 data.
 *  0b1..This is the last Class 1 data.
 */
#define CAAM_CNFIFO_2_LC1(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_LC1_SHIFT)) & CAAM_CNFIFO_2_LC1_MASK)

#define CAAM_CNFIFO_2_LC2_MASK                   (0x20000000U)
#define CAAM_CNFIFO_2_LC2_SHIFT                  (29U)
/*! LC2
 *  0b0..This is not the last Class 2 data.
 *  0b1..This is the last Class 2 data.
 */
#define CAAM_CNFIFO_2_LC2(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_LC2_SHIFT)) & CAAM_CNFIFO_2_LC2_MASK)

#define CAAM_CNFIFO_2_DEST_MASK                  (0xC0000000U)
#define CAAM_CNFIFO_2_DEST_SHIFT                 (30U)
/*! DEST
 *  0b00..DECO Alignment Block. If DTYPE is Eh, data sent to the DECO Alignment Block is dropped. This is used to
 *        skip over input data. An error is generated if a DTYPE other than Eh (drop) or Fh (message) is used with
 *        the DECO Alignment Block destination.
 *  0b01..Class 1.
 *  0b10..Class 2.
 *  0b11..Both Class 1 and Class 2.
 */
#define CAAM_CNFIFO_2_DEST(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_DEST_SHIFT)) & CAAM_CNFIFO_2_DEST_MASK)
/*! @} */

/* The count of CAAM_CNFIFO_2 */
#define CAAM_CNFIFO_2_COUNT                      (1U)

/*! @name CIFIFO - CCB 0 Input Data FIFO */
/*! @{ */

#define CAAM_CIFIFO_IFIFO_MASK                   (0xFFFFFFFFU)
#define CAAM_CIFIFO_IFIFO_SHIFT                  (0U)
#define CAAM_CIFIFO_IFIFO(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CIFIFO_IFIFO_SHIFT)) & CAAM_CIFIFO_IFIFO_MASK)
/*! @} */

/* The count of CAAM_CIFIFO */
#define CAAM_CIFIFO_COUNT                        (1U)

/*! @name COFIFO - CCB 0 Output Data FIFO */
/*! @{ */

#define CAAM_COFIFO_OFIFO_MASK                   (0xFFFFFFFFFFFFFFFFU)
#define CAAM_COFIFO_OFIFO_SHIFT                  (0U)
#define CAAM_COFIFO_OFIFO(x)                     (((uint64_t)(((uint64_t)(x)) << CAAM_COFIFO_OFIFO_SHIFT)) & CAAM_COFIFO_OFIFO_MASK)
/*! @} */

/* The count of CAAM_COFIFO */
#define CAAM_COFIFO_COUNT                        (1U)

/*! @name DJQCR_MS - DECO0 Job Queue Control Register, most-significant half */
/*! @{ */

#define CAAM_DJQCR_MS_ID_MASK                    (0x7U)
#define CAAM_DJQCR_MS_ID_SHIFT                   (0U)
#define CAAM_DJQCR_MS_ID(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_ID_SHIFT)) & CAAM_DJQCR_MS_ID_MASK)

#define CAAM_DJQCR_MS_SRC_MASK                   (0x700U)
#define CAAM_DJQCR_MS_SRC_SHIFT                  (8U)
/*! SRC
 *  0b000..Job Ring 0
 *  0b001..Job Ring 1
 *  0b010..Job Ring 2
 *  0b011..Job Ring 3
 *  0b100..RTIC
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..Reserved
 */
#define CAAM_DJQCR_MS_SRC(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_SRC_SHIFT)) & CAAM_DJQCR_MS_SRC_MASK)

#define CAAM_DJQCR_MS_AMTD_MASK                  (0x8000U)
#define CAAM_DJQCR_MS_AMTD_SHIFT                 (15U)
/*! AMTD
 *  0b0..The Allowed Make Trusted Descriptor bit was NOT set.
 *  0b1..The Allowed Make Trusted Descriptor bit was set.
 */
#define CAAM_DJQCR_MS_AMTD(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_AMTD_SHIFT)) & CAAM_DJQCR_MS_AMTD_MASK)

#define CAAM_DJQCR_MS_SOB_MASK                   (0x10000U)
#define CAAM_DJQCR_MS_SOB_SHIFT                  (16U)
/*! SOB
 *  0b0..Shared Descriptor has NOT been loaded.
 *  0b1..Shared Descriptor HAS been loaded.
 */
#define CAAM_DJQCR_MS_SOB(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_SOB_SHIFT)) & CAAM_DJQCR_MS_SOB_MASK)

#define CAAM_DJQCR_MS_DWS_MASK                   (0x80000U)
#define CAAM_DJQCR_MS_DWS_SHIFT                  (19U)
/*! DWS
 *  0b0..Double Word Swap is NOT set.
 *  0b1..Double Word Swap is set.
 */
#define CAAM_DJQCR_MS_DWS(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_DWS_SHIFT)) & CAAM_DJQCR_MS_DWS_MASK)

#define CAAM_DJQCR_MS_SHR_FROM_MASK              (0x7000000U)
#define CAAM_DJQCR_MS_SHR_FROM_SHIFT             (24U)
#define CAAM_DJQCR_MS_SHR_FROM(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_SHR_FROM_SHIFT)) & CAAM_DJQCR_MS_SHR_FROM_MASK)

#define CAAM_DJQCR_MS_ILE_MASK                   (0x8000000U)
#define CAAM_DJQCR_MS_ILE_SHIFT                  (27U)
/*! ILE
 *  0b0..No byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.
 *  0b1..Byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.
 */
#define CAAM_DJQCR_MS_ILE(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_ILE_SHIFT)) & CAAM_DJQCR_MS_ILE_MASK)

#define CAAM_DJQCR_MS_FOUR_MASK                  (0x10000000U)
#define CAAM_DJQCR_MS_FOUR_SHIFT                 (28U)
/*! FOUR
 *  0b0..DECO has not been given at least four words of the descriptor.
 *  0b1..DECO has been given at least four words of the descriptor.
 */
#define CAAM_DJQCR_MS_FOUR(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_FOUR_SHIFT)) & CAAM_DJQCR_MS_FOUR_MASK)

#define CAAM_DJQCR_MS_WHL_MASK                   (0x20000000U)
#define CAAM_DJQCR_MS_WHL_SHIFT                  (29U)
/*! WHL
 *  0b0..DECO has not been given the whole descriptor.
 *  0b1..DECO has been given the whole descriptor.
 */
#define CAAM_DJQCR_MS_WHL(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_WHL_SHIFT)) & CAAM_DJQCR_MS_WHL_MASK)

#define CAAM_DJQCR_MS_SING_MASK                  (0x40000000U)
#define CAAM_DJQCR_MS_SING_SHIFT                 (30U)
/*! SING
 *  0b0..Do not tell DECO to execute the descriptor in single-step mode.
 *  0b1..Tell DECO to execute the descriptor in single-step mode.
 */
#define CAAM_DJQCR_MS_SING(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_SING_SHIFT)) & CAAM_DJQCR_MS_SING_MASK)

#define CAAM_DJQCR_MS_STEP_MASK                  (0x80000000U)
#define CAAM_DJQCR_MS_STEP_SHIFT                 (31U)
/*! STEP
 *  0b0..DECO has not been told to execute the next command in the descriptor.
 *  0b1..DECO has been told to execute the next command in the descriptor.
 */
#define CAAM_DJQCR_MS_STEP(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_MS_STEP_SHIFT)) & CAAM_DJQCR_MS_STEP_MASK)
/*! @} */

/* The count of CAAM_DJQCR_MS */
#define CAAM_DJQCR_MS_COUNT                      (1U)

