Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_DGTR_2_Length_MASK                  (0x3FFFFFFFU)
#define CAAM_DGTR_2_Length_SHIFT                 (0U)
#define CAAM_DGTR_2_Length(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DGTR_2_Length_SHIFT)) & CAAM_DGTR_2_Length_MASK)

#define CAAM_DGTR_2_F_MASK                       (0x40000000U)
#define CAAM_DGTR_2_F_SHIFT                      (30U)
/*! F
 *  0b0..This is not the last entry of the SGT.
 *  0b1..This is the last entry of the SGT.
 */
#define CAAM_DGTR_2_F(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DGTR_2_F_SHIFT)) & CAAM_DGTR_2_F_MASK)

#define CAAM_DGTR_2_E_MASK                       (0x80000000U)
#define CAAM_DGTR_2_E_SHIFT                      (31U)
/*! E
 *  0b0..Address Pointer points to a memory buffer.
 *  0b1..Address Pointer points to a Scatter/Gather Table Entry.
 */
#define CAAM_DGTR_2_E(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DGTR_2_E_SHIFT)) & CAAM_DGTR_2_E_MASK)
/*! @} */

/* The count of CAAM_DGTR_2 */
#define CAAM_DGTR_2_COUNT                        (1U)

/* The count of CAAM_DGTR_2 */
#define CAAM_DGTR_2_COUNT2                       (1U)

/*! @name DGTR_3 - DECO0 Gather Table Register 0 Word 3 */
/*! @{ */

#define CAAM_DGTR_3_Offset_MASK                  (0x1FFFU)
#define CAAM_DGTR_3_Offset_SHIFT                 (0U)
#define CAAM_DGTR_3_Offset(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DGTR_3_Offset_SHIFT)) & CAAM_DGTR_3_Offset_MASK)
/*! @} */

/* The count of CAAM_DGTR_3 */
#define CAAM_DGTR_3_COUNT                        (1U)

/* The count of CAAM_DGTR_3 */
#define CAAM_DGTR_3_COUNT2                       (1U)

/*! @name DSTR_0 - DECO0 Scatter Table Register 0 Word 0 */
/*! @{ */

#define CAAM_DSTR_0_ADDRESS_POINTER_MASK         (0xFU)
#define CAAM_DSTR_0_ADDRESS_POINTER_SHIFT        (0U)
/*! ADDRESS_POINTER - most-significant bits of memory address pointed to by table entry */
#define CAAM_DSTR_0_ADDRESS_POINTER(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_DSTR_0_ADDRESS_POINTER_SHIFT)) & CAAM_DSTR_0_ADDRESS_POINTER_MASK)
/*! @} */

/* The count of CAAM_DSTR_0 */
#define CAAM_DSTR_0_COUNT                        (1U)

/* The count of CAAM_DSTR_0 */
#define CAAM_DSTR_0_COUNT2                       (1U)

/*! @name DSTR_1 - DECO0 Scatter Table Register 0 Word 1 */
/*! @{ */

#define CAAM_DSTR_1_ADDRESS_POINTER_MASK         (0xFFFFFFFFU)
#define CAAM_DSTR_1_ADDRESS_POINTER_SHIFT        (0U)
#define CAAM_DSTR_1_ADDRESS_POINTER(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_DSTR_1_ADDRESS_POINTER_SHIFT)) & CAAM_DSTR_1_ADDRESS_POINTER_MASK)
/*! @} */

/* The count of CAAM_DSTR_1 */
#define CAAM_DSTR_1_COUNT                        (1U)

/* The count of CAAM_DSTR_1 */
#define CAAM_DSTR_1_COUNT2                       (1U)

/*! @name DSTR_2 - DECO0 Scatter Table Register 0 Word 2 */
/*! @{ */

#define CAAM_DSTR_2_Length_MASK                  (0x3FFFFFFFU)
#define CAAM_DSTR_2_Length_SHIFT                 (0U)
#define CAAM_DSTR_2_Length(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DSTR_2_Length_SHIFT)) & CAAM_DSTR_2_Length_MASK)

#define CAAM_DSTR_2_F_MASK                       (0x40000000U)
#define CAAM_DSTR_2_F_SHIFT                      (30U)
/*! F
 *  0b0..This is not the last entry of the SGT.
 *  0b1..This is the last entry of the SGT.
 */
#define CAAM_DSTR_2_F(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DSTR_2_F_SHIFT)) & CAAM_DSTR_2_F_MASK)

#define CAAM_DSTR_2_E_MASK                       (0x80000000U)
#define CAAM_DSTR_2_E_SHIFT                      (31U)
/*! E
 *  0b0..Address Pointer points to a memory buffer.
 *  0b1..Address Pointer points to a Scatter/Gather Table Entry.
 */
#define CAAM_DSTR_2_E(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DSTR_2_E_SHIFT)) & CAAM_DSTR_2_E_MASK)
/*! @} */

/* The count of CAAM_DSTR_2 */
#define CAAM_DSTR_2_COUNT                        (1U)

/* The count of CAAM_DSTR_2 */
#define CAAM_DSTR_2_COUNT2                       (1U)

/*! @name DSTR_3 - DECO0 Scatter Table Register 0 Word 3 */
/*! @{ */

#define CAAM_DSTR_3_Offset_MASK                  (0x1FFFU)
#define CAAM_DSTR_3_Offset_SHIFT                 (0U)
#define CAAM_DSTR_3_Offset(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DSTR_3_Offset_SHIFT)) & CAAM_DSTR_3_Offset_MASK)
/*! @} */

/* The count of CAAM_DSTR_3 */
#define CAAM_DSTR_3_COUNT                        (1U)

/* The count of CAAM_DSTR_3 */
#define CAAM_DSTR_3_COUNT2                       (1U)

/*! @name DDESB - DECO0 Descriptor Buffer Word 0..DECO0 Descriptor Buffer Word 63 */
/*! @{ */

#define CAAM_DDESB_DESBW_MASK                    (0xFFFFFFFFU)
#define CAAM_DDESB_DESBW_SHIFT                   (0U)
#define CAAM_DDESB_DESBW(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_DDESB_DESBW_SHIFT)) & CAAM_DDESB_DESBW_MASK)
/*! @} */

/* The count of CAAM_DDESB */
#define CAAM_DDESB_COUNT                         (1U)

/* The count of CAAM_DDESB */
#define CAAM_DDESB_COUNT2                        (64U)

/*! @name DDJR - DECO0 Debug Job Register */
/*! @{ */

#define CAAM_DDJR_ID_MASK                        (0x7U)
#define CAAM_DDJR_ID_SHIFT                       (0U)
#define CAAM_DDJR_ID(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_ID_SHIFT)) & CAAM_DDJR_ID_MASK)

#define CAAM_DDJR_SRC_MASK                       (0x700U)
#define CAAM_DDJR_SRC_SHIFT                      (8U)
/*! SRC
 *  0b000..Job Ring 0
 *  0b001..Job Ring 1
 *  0b010..Job Ring 2
 *  0b011..Job Ring 3
 *  0b100..RTIC
 *  0b101, 0b110, 0b111..Reserved
 */
#define CAAM_DDJR_SRC(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_SRC_SHIFT)) & CAAM_DDJR_SRC_MASK)

#define CAAM_DDJR_JDDS_MASK                      (0x4000U)
#define CAAM_DDJR_JDDS_SHIFT                     (14U)
/*! JDDS
 *  0b0..Non-SEQ DID
 *  0b1..SEQ DID
 */
#define CAAM_DDJR_JDDS(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_JDDS_SHIFT)) & CAAM_DDJR_JDDS_MASK)

#define CAAM_DDJR_AMTD_MASK                      (0x8000U)
#define CAAM_DDJR_AMTD_SHIFT                     (15U)
/*! AMTD
 *  0b0..The Allowed Make Trusted Descriptor bit was NOT set.
 *  0b1..The Allowed Make Trusted Descriptor bit was set.
 */
#define CAAM_DDJR_AMTD(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_AMTD_SHIFT)) & CAAM_DDJR_AMTD_MASK)

#define CAAM_DDJR_GSD_MASK                       (0x10000U)
#define CAAM_DDJR_GSD_SHIFT                      (16U)
/*! GSD
 *  0b0..Shared Descriptor was NOT obtained from another DECO.
 *  0b1..Shared Descriptor was obtained from another DECO.
 */
#define CAAM_DDJR_GSD(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_GSD_SHIFT)) & CAAM_DDJR_GSD_MASK)

#define CAAM_DDJR_DWS_MASK                       (0x80000U)
#define CAAM_DDJR_DWS_SHIFT                      (19U)
/*! DWS
 *  0b0..Double Word Swap is NOT set.
 *  0b1..Double Word Swap is set.
 */
#define CAAM_DDJR_DWS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_DWS_SHIFT)) & CAAM_DDJR_DWS_MASK)

