Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CAAM.h
#define CAAM_DDJR_SHR_FROM_MASK                  (0x7000000U)
#define CAAM_DDJR_SHR_FROM_SHIFT                 (24U)
#define CAAM_DDJR_SHR_FROM(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_SHR_FROM_SHIFT)) & CAAM_DDJR_SHR_FROM_MASK)

#define CAAM_DDJR_ILE_MASK                       (0x8000000U)
#define CAAM_DDJR_ILE_SHIFT                      (27U)
/*! ILE
 *  0b0..No byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.
 *  0b1..Byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.
 */
#define CAAM_DDJR_ILE(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_ILE_SHIFT)) & CAAM_DDJR_ILE_MASK)

#define CAAM_DDJR_FOUR_MASK                      (0x10000000U)
#define CAAM_DDJR_FOUR_SHIFT                     (28U)
/*! FOUR
 *  0b0..DECO has not been given at least four words of the descriptor.
 *  0b1..DECO has been given at least four words of the descriptor.
 */
#define CAAM_DDJR_FOUR(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_FOUR_SHIFT)) & CAAM_DDJR_FOUR_MASK)

#define CAAM_DDJR_WHL_MASK                       (0x20000000U)
#define CAAM_DDJR_WHL_SHIFT                      (29U)
/*! WHL
 *  0b0..DECO has not been given the whole descriptor.
 *  0b1..DECO has been given the whole descriptor.
 */
#define CAAM_DDJR_WHL(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_WHL_SHIFT)) & CAAM_DDJR_WHL_MASK)

#define CAAM_DDJR_SING_MASK                      (0x40000000U)
#define CAAM_DDJR_SING_SHIFT                     (30U)
/*! SING
 *  0b0..DECO has not been told to execute the descriptor in single-step mode.
 *  0b1..DECO has been told to execute the descriptor in single-step mode.
 */
#define CAAM_DDJR_SING(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_SING_SHIFT)) & CAAM_DDJR_SING_MASK)

#define CAAM_DDJR_STEP_MASK                      (0x80000000U)
#define CAAM_DDJR_STEP_SHIFT                     (31U)
/*! STEP
 *  0b0..DECO has not been told to execute the next command in the descriptor.
 *  0b1..DECO has been told to execute the next command in the descriptor.
 */
#define CAAM_DDJR_STEP(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_DDJR_STEP_SHIFT)) & CAAM_DDJR_STEP_MASK)
/*! @} */

/* The count of CAAM_DDJR */
#define CAAM_DDJR_COUNT                          (1U)

/*! @name DDDR - DECO0 Debug DECO Register */
/*! @{ */

#define CAAM_DDDR_CT_MASK                        (0x1U)
#define CAAM_DDDR_CT_SHIFT                       (0U)
/*! CT
 *  0b0..This DECO is NOTcurrently generating the signature of a Trusted Descriptor.
 *  0b1..This DECO is currently generating the signature of a Trusted Descriptor.
 */
#define CAAM_DDDR_CT(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_CT_SHIFT)) & CAAM_DDDR_CT_MASK)

#define CAAM_DDDR_BRB_MASK                       (0x2U)
#define CAAM_DDDR_BRB_SHIFT                      (1U)
/*! BRB
 *  0b0..The READ machine in the Burster is not busy.
 *  0b1..The READ machine in the Burster is busy.
 */
#define CAAM_DDDR_BRB(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_BRB_SHIFT)) & CAAM_DDDR_BRB_MASK)

#define CAAM_DDDR_BWB_MASK                       (0x4U)
#define CAAM_DDDR_BWB_SHIFT                      (2U)
/*! BWB
 *  0b0..The WRITE machine in the Burster is not busy.
 *  0b1..The WRITE machine in the Burster is busy.
 */
#define CAAM_DDDR_BWB(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_BWB_SHIFT)) & CAAM_DDDR_BWB_MASK)

#define CAAM_DDDR_NC_MASK                        (0x8U)
#define CAAM_DDDR_NC_SHIFT                       (3U)
/*! NC
 *  0b0..This DECO is currently executing a command.
 *  0b1..This DECO is not currently executing a command.
 */
#define CAAM_DDDR_NC(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_NC_SHIFT)) & CAAM_DDDR_NC_MASK)

#define CAAM_DDDR_CSA_MASK                       (0x10U)
#define CAAM_DDDR_CSA_SHIFT                      (4U)
#define CAAM_DDDR_CSA(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_CSA_SHIFT)) & CAAM_DDDR_CSA_MASK)

#define CAAM_DDDR_CMD_STAGE_MASK                 (0xE0U)
#define CAAM_DDDR_CMD_STAGE_SHIFT                (5U)
#define CAAM_DDDR_CMD_STAGE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_CMD_STAGE_SHIFT)) & CAAM_DDDR_CMD_STAGE_MASK)

#define CAAM_DDDR_CMD_INDEX_MASK                 (0x3F00U)
#define CAAM_DDDR_CMD_INDEX_SHIFT                (8U)
#define CAAM_DDDR_CMD_INDEX(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_CMD_INDEX_SHIFT)) & CAAM_DDDR_CMD_INDEX_MASK)

#define CAAM_DDDR_NLJ_MASK                       (0x4000U)
#define CAAM_DDDR_NLJ_SHIFT                      (14U)
/*! NLJ
 *  0b0..The original job descriptor running in this DECO has not caused another job descriptor to be executed.
 *  0b1..The original job descriptor running in this DECO has caused another job descriptor to be executed.
 */
#define CAAM_DDDR_NLJ(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_NLJ_SHIFT)) & CAAM_DDDR_NLJ_MASK)

#define CAAM_DDDR_PTCL_RUN_MASK                  (0x8000U)
#define CAAM_DDDR_PTCL_RUN_SHIFT                 (15U)
/*! PTCL_RUN
 *  0b0..No protocol is running in this DECO.
 *  0b1..A protocol is running in this DECO.
 */
#define CAAM_DDDR_PTCL_RUN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_PTCL_RUN_SHIFT)) & CAAM_DDDR_PTCL_RUN_MASK)

#define CAAM_DDDR_PDB_STALL_MASK                 (0x30000U)
#define CAAM_DDDR_PDB_STALL_SHIFT                (16U)
#define CAAM_DDDR_PDB_STALL(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_PDB_STALL_SHIFT)) & CAAM_DDDR_PDB_STALL_MASK)

#define CAAM_DDDR_PDB_WB_ST_MASK                 (0xC0000U)
#define CAAM_DDDR_PDB_WB_ST_SHIFT                (18U)
#define CAAM_DDDR_PDB_WB_ST(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_PDB_WB_ST_SHIFT)) & CAAM_DDDR_PDB_WB_ST_MASK)

#define CAAM_DDDR_DECO_STATE_MASK                (0xF00000U)
#define CAAM_DDDR_DECO_STATE_SHIFT               (20U)
#define CAAM_DDDR_DECO_STATE(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_DECO_STATE_SHIFT)) & CAAM_DDDR_DECO_STATE_MASK)

